{
  "company": "outfit7",
  "fetched_at": "2026-02-03T04:50:16.338352",
  "job_count": 15,
  "jobs": [
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7523742003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5676624003,
      "location": {
        "name": "Shanghai"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "China publishing",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "If ads, data, and games are your playground, this role is built for you. You’ll turn ad spaces into smart revenue opportunities, elevating performance through insight and creativity, and making every impression truly count. In this role, you’ll connect teams, cultures, and platforms – helping Outfit7’s games continue to shine in the China market.\nReady to create impact? Join us and help shape the future of our growth in China.\n如果你热爱广告、数据与游戏，这个岗位正好适合你！你将负责把广告位变成收益机会，用洞察力与创意优化广告表现，让每一次曝光都真正有价值。在这个岗位上，你将连接团队、文化与平台，助力 Outfit7 的游戏在中国市场持续闪耀。\n准备好创造影响力了吗？加入我们，共同推动我们在中国的增长未来。",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "Own the overall ad monetization business and operations for Outfit7’s games in the China market.\nBuild and maintain strong relationships with ad teams at game publishing channels and third-party ad platforms, ensuring seamless partnership and collaboration.\nHandle daily hands-on ad operations, including monitoring ad performance, identifying potential issues, communicating with external partners and internal teams to resolve challenges and improve results, and ensuring the operation of ad configurations.\nDevelop and execute ad performance improvement plans across all Outfit7 games in China, with a deep understanding of Outfit7 games' ad monetization logic and strong professional knowledge in ad-related areas.\nRegularly deliver ad performance analytic reports to internal teams.\n职责：\n负责Outfit7游戏在中国市场的整体广告变现业务与运营。\n建立并维护与游戏发行渠道广告团队及第三方广告平台的良好合作关系，确保顺畅的合作与沟通。\n负责日常广告运营工作，包括监控广告表现、发现潜在问题、与外部合作伙伴及内部团队沟通协作，解决相关问题以提升广告效果，并负责广告配置的日常管理与运营。\n为 Outfit7 在中国的所有游戏制定并执行广告效果优化方案，深入理解公司游戏的广告变现逻辑，并具备扎实的广告领域专业能力。\n定期向内部团队提供广告表现分析报告。",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "Strong communication skills with the ability to convert a large amount of information into a clear message and utilize it to persuade players, colleagues, and the whole international team.\nExcellent ability to promote collaboration across languages and cultures.\nStrong organizational skills with the ability to track milestones and follow through on a project to its conclusion.\nDetail-oriented and able to assess progress, challenges, and priorities at each stage and to provide timely updates to the team.\nAnalytical, flexible, action-oriented, results-oriented, and self-motivated.\nStrong ad monetization knowledge and data analytics skills.\n任职要求：\n具备出色的沟通能力，能够将大量信息转化为清晰的表达，并有效说服玩家、同事及整个国际团队。\n具备卓越的跨语言、跨文化协作推动能力。\n具备良好的组织能力，能够跟踪各项目里程并推动项目顺利完成。\n注重细节，能准确识别各阶段的工作进展、风险与优先级，并及时向团队更新。\n具备分析能力、灵活性、行动导向和结果导向，且能够主动承担责任。\n具备扎实的广告变现知识及数据分析能力。",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "4+ years of ad operations experience in the games industry, with a strong professional knowledge of ad monetization in the China market.\nExperience in ad performance data analytics and related tools.\nExperience working with international or cross-functional teams.\nPassion for the mobile games industry.\nFluency in the English language, both written and spoken.  \n\n经验要求：\n4 年以上游戏行业广告运营经验，具备扎实的中国市场广告变现专业知识。\n具备广告效果数据分析经验，熟悉相关分析工具。\n有与国际团队或跨职能团队合作的经验。\n对移动游戏行业充满热情。\n具备流利的英语书面和口头表达能力。",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "Employment relationship with Outfit7 Network Technology Co., Ltd. Shanghai Branch for a fixed term period of three years, with a six-month probationary period and the option to prolong the contract.\nDiverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\nParticipation in attractive projects.\nDevelopment opportunities through training, seminars, and conferences.\nChoice of sport, fitness, educational, and entertainment activities outside of work.\nWork-life balance.\nOffice snacks and coffee\nParticipation in a discretionary bonus plan\nChristmas bonus (subject to internal company policies) \n\n \n我们提供\n与奥飞特七网络科技有限公司上海分公司签订为期三年的劳动合同，试用期六个月，三年合同期满后可选择续签无限期延长合同。\n一个年轻的团队，工作内容多元化，日常带来令人激动的各种挑战，工作环境有趣且轻松。\n参与有吸引力的项目。\n培训、论坛以及行业会议等职业发展机会。\n工作之余提供可选的运动、健身、教育以及娱乐活动。\n工作生活平衡。\n办公室下午茶。\n参与公司绩效奖金计划\n圣诞奖金（根据公司内部政策执行）",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": null,
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "/",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Sales & Business Development",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Dan Li",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "On-site"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7523742003,
      "updated_at": "2025-11-24T01:25:18-05:00",
      "requisition_id": "445",
      "title": "Business Operations Adviser(Game Ads Operations) / 游戏广告运营经理",
      "company_name": "Outfit7",
      "first_published": "2025-11-24T01:25:18-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7451065003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5633554003,
      "location": {
        "name": "shanghai"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "China publishing",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "Do you see co-publishing operations as more than just checklists and backend tasks? For you, it’s all about crafting campaigns that resonate, building communities that engage, and fine-tuning store integration to improve user conversion. From co-ordinating store promotions to extracting data insights, every detail matters, and you know how to draw them all together to produce results that scale. If you’re ready to turn expertise into execution, and execution into measurable impact, we’re ready to have you on board.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "Be responsible for co-publishing operations, including resource applications and reservations, material production, campaign configuration, game package updates, and content releases, ensuring the achievement of operational objectives at all stages.\nProactively secure cooperation resources from co-publishing stores (e.g., vivo, OPPO, Huawei, Xiaomi), and improve the utilization of these resources through precision operation methods like A/B Testing and user segmentation.\nCollaborating with the technical team to manage app store compliance for the product and drive data-driven product optimization.Drive and follow up on product capability adaptation for store integration (e.g., SDK compliance, package loading optimization) to boost user conversion from the product capability side.\nEstablish exclusive communities for users of co-publishing stores, collaborate with marketing and community teams on store user operations, and effectively enhance product awareness across channels.\nDraft special campaign plans, oversee the entire process of material production and campaign rollout, and ensure smooth execution by coordinating cross-departmental resources.\n\n\n岗位职责：\n负责联运渠道的资源申请、资源预约、素材产出、活动配置、包体更新及内容发布等运营工作，保障各阶段运营目标达成;；\n积极推进争取联运渠道合作资源（vivo、OPPO、华为、小米等），并通过 A/B Test、用户分层等精细化运营手段，提升合作资源的使用效率;；\n推动并跟进产品接入渠道的相关能力适配（包括 SDK 合规适配、包体加载优化等），从产品能力层面提升用户转化效率；\n搭建渠道联运专属社区，联动市场、社区等多部门开展渠道用户运营，有效提升产品在各渠道的用户认知度;\n负责撰写活动专项方案，跟进完整的素材制作及活动落地流程，并协调高效利用各部门资源保障执行",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "Familiarity with user demographics and characteristics, with store integration requirements, and with the material and campaign preferences of co-publishing stores.\nKnowing the listing rules (e.g., submission, compliance) of various app stores.and Understanding how to set up in-store backend campaigns to improve channel performance metrics.\nProficiency in working with the backend systems of co-publishing stores.\nAbility to perform and oversee core tasks such as promotional resource applications, H5 campaign configuration, push notifications, and exclusive community content publishing.\nAbility to independently develop, finalize, and execute store campaigns based on various project phases and user segmentations, with relevant successful case experience.\nData analysis skills strong enough to identify key issues and summarize insights from the entire user conversion funnel, and to drive reviews and optimizations.\nStrong logical thinking, excellent communication skills and a proactive attitude to learning.\nAbility to responsibly and efficiently manage concurrent tasks and Cross-department collaboration\n\n\n任职要求：\n熟悉联运渠道的用户属性、产品能力要求、素材及活动偏好，掌握渠道资源规则及线上线下多场景合作模式；\n熟悉联运渠道后台系统操作，可熟练完成资源申请、H5 活动配置、Push 推送、专属社区内容发布等核心操作；\n能结合项目不同阶段及用户分层特点，独立完成渠道活动的规划、方案输出与落地执行，且具备相关成功案例经验；\n具备基础数据分析能力，善于从用户转化全链条中提炼关键问题、总结经验，并推动复盘优化落地；\n具备较强逻辑思维，善于沟通表达与主动学习思考，责任心强，可高效处理多线程并行任务及多模块协作工作；",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "1+ years of channel operation experience, including experience independently leading and completing the end-to-end channel launch process for products.\nGood English proficiency, with basic English communication skills (written/oral) in work scenarios.\nEnglish reading and writing skills are preferred\n\n经验要求\n1年以上渠道运营经验，包括独立负责并完成产品从上线到落地的全流程渠道运营经验。\n良好的英语能力，能够在工作场景下进行基本的英语沟通（书面/口语）。\n英文读写能力优先。",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "What we offer\n\nEmployment relationship with Outfit7 Network Technology Co., Ltd Shanghai Branch for a fixed term period of three years, with a six-month probationary period and the option to prolong the contract.\nDiverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\nParticipation in attractive projects.\nDevelopment opportunities through training, seminars, and conferences.\nChoice of sport, fitness, educational, and entertainment activities outside of work.\nWork-life balance.\nOffice snacks and coffee\nParticipation in a discretionary bonus plan\nChristmas bonus (subject to internal company policies) \n\n\n我们提供\n\n与奥飞特七网络科技有限公司上海分公司签订为期三年的劳动合同，试用期六个月，三年合同期满后可选择续签无限期延长合同。\n一个年轻的团队，工作内容多元化，日常带来令人激动的各种挑战，工作环境有趣且轻松。\n参与有吸引力的项目。\n培训、论坛以及行业会议等职业发展机会。\n工作之余提供可选的运动、健身、教育以及娱乐活动。\n工作生活平衡。\n办公室下午茶。\n参与公司绩效奖金计划\n圣诞奖金（根据公司内部政策执行）",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": null,
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "/",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Sales & Business Development",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Dan Li",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "On-site"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7451065003,
      "updated_at": "2025-12-04T05:04:06-05:00",
      "requisition_id": "436",
      "title": "Business Operations Specialist / 渠道运营专员",
      "company_name": "Outfit7",
      "first_published": "2025-12-01T03:37:33-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7531952003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5680129003,
      "location": {
        "name": "Limassol, Cyprus"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Talking Tom and Friends",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "We’re looking for a Chief Product Officer (CPO) to lead the next era of Outfit7’s growth. You’ll connect creativity with strategy, transforming ideas into world-class products that delight players and define what’s next in mobile entertainment.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Define and lead the company’s products vision, strategy and goals, ensuring alignment with long-term business objectives.\n- Oversee all games in Talking Tom and Friends product line, and other company games and entertainment directions, and roadmaps, managing cross-functional collaboration across design, development, marketing, data and operations.\n- Supervise company-wide priorities, budgets and delivery processes, turning the vision into achievable plans.\n- Lead and mentor senior managers and key roles, supporting their growth and empowering high-performing teams.\n- Recognise and initiate strategic opportunities that move the company forward.\n- Make and stand behind the most difficult decisions, communicating the “why” with clarity and confidence.\n- Inspire others to share and live the company vision — keeping teams motivated, aligned, and connected.\n- Anticipate risks and scenarios, lead through uncertainty with calm and clarity.\n- Ensure that every product we deliver reflects the quality, creativity, and spirit that define Outfit7.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Excellent communication and leadership skills, with the ability to inspire at every level of the organisation.\n- Strong strategic and analytical thinking — you see the whole business, not just the product.\n- Deep understanding of product development, live operations, growth metrics and market dynamics.\n- A growth mindset: proactive, adaptable, and focused on long-term success.\n- Ability to make and own tough decisions — and to bring people with you.\n- Passion for games, entertainment, and creating experiences that delight millions.\n- Fluency in English (written & spoken).",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- Proven track record in a C-level or senior product executive role (e.g., CPO, VP of Product) — in the gaming or digital entertainment industry.\n- Proven gaming industry experience: understanding of hybrid casual and casual games.\n- Success leading teams through critical phases, reversing negative trends, and/or driving growth or product recovery.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Outfit7 Limited for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal company policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": null,
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Product & Production",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Tetiana Nevmerzhytska",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7531952003,
      "updated_at": "2025-12-02T09:14:15-05:00",
      "requisition_id": "447",
      "title": "Chief Product Officer",
      "company_name": "Outfit7",
      "first_published": "2025-12-02T09:14:15-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7582339003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5698290003,
      "location": {
        "name": "Ljubljana, Slovenia"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Marketing",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "We’re looking for up-and-coming writing aficionados who can take on cross-funnel creative initiatives, from ideation to copy execution. You’ll be collaborating with a diverse range of art, design, and video experts, helping to launch the next product campaign to millions of users worldwide. The ideal candidate is on top of the latest user-acquisition and social media trends, understands what makes creatives click, and is motivated by the number of game downloads, not just impressions.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Collaborate with the Marketing Creative Director to implement creative strategy for all of Outfit7 product campaigns.\n- Script marketing video assets (trailers, gameplays, UA videos, store front videos, TikToks, …).\n- Provide copy for a wide variety of marketing materials (app store events, app store descriptions, UA texts, social media, pitching documents, …).\n- Collaborate across other marketing departments (art, design, video, strategy, PR, …).\n- Analyze the performance of creatives and apply these learnings to future campaigns.\n- Stay informed on industry trends, emerging platforms, and market shifts in order to proactively identify opportunities for impactful creative executions.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- A good understanding of different marketing writing formats.\n- Ability to contribute to the ideation of different marketing assets.\n- High level of proficiency in both spoken and written English.\n- A performance creative mindset that understands distribution goals and channel specifics.\n- Ability to adapt the written tone of voice based on different products and briefs.\n- Skilled at setting clear priorities based on deadlines and project needs.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 1-3 years of hands-on writing experience either at an advertising agency or as an in-house creative for a gaming company.\n- Experience in writing for different marketing formats, distinguishing between distribution channels and target audiences.\n- Experience with writing video scripts for a variety of short and longform advertising video assets.\n- Basic time and project management experience with tools like Trello or similar.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2 d.o.o. for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office\n- Flexible working hours\n- 24 days of paid vacation\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Specialist za področje kreativnega marketinga II",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevajo se izkušnje ali znanje s področja marketinškega pisanja. Ponujamo pogodbo o zaposlitvi za nedoločen čas s šestmesečnim poskusnim obdobjem v podjetju Ekipa2 d.o.o. s sedežem v Ljubljani. Rok za prijavo: 8.02.2026",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Marketing & Publishing",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Tetiana Nevmerzhytska",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7582339003,
      "updated_at": "2026-01-21T07:35:05-05:00",
      "requisition_id": "452",
      "title": "Marketing Creative Specialist (Writer)",
      "company_name": "Outfit7",
      "first_published": "2026-01-08T08:49:22-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7598892003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5705224003,
      "location": {
        "name": "Ljubljana, Limassol"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Talking Tom and Friends",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "2",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "Do you want to work with a talented team developing mobile games?\n\nThen you might be the experienced game developer we’re looking for to help us maintain and further improve the portfolio of award-winning games like My Talking Angela 2, My Talking Tom 2 and My Talking Tom Friends 2. In addition, you will eventually work on developing new games across the franchise. Our ideal candidate will cover everything from delving deep into game and engine code to implementing new features; all with a proactive, lead-by-example attitude.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Plan and implement most complex game features and components for live mobile games using in-house Starlite game engine written in C++ and Unity game engine (depends on department needs during onboarding phase).\n- Collaborate, communicate, and work efficiently as part of the multidisciplinary team, and across various other departments and the Starlite engine team to address most important technical challenges of high business value.\n- Maintain and improve game code, libraries and tools for artists and designers.\n- Share knowledge, mentor engineers and drive projects and workflow improvements across the whole department.\n- Learn more about Starlite game engine from Outfit7 Tech Blog:  Building the - Ultimate Mobile Game Engine: Starlite https://outfit7.com/blog/tech/building-the-ultimate-mobile-game-engine-starlite",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Good communication and interpersonal skills, with fluency in the English language (both written and spoken).\n- Positive, make-it-happen, lead-by-example attitude.\n- Proactive working style, with the ability to work in a fast-paced environment with tight deadlines and short production pipeline life-cycles.\n- Technical team lead experience (implementation planning, tasks delegation, coordinating with other disciplines, mentoring less experienced developers, etc.) \n- Eagerness for learning new technologies and gaining new skills.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 10+ years of professional experience in game development.\n- Excellent technical background (emphasis is on game engine architecture, performance optimisation and graphics pipeline).\n- Excellency either in C++ or C# programming, experience in both.\n- Professional experience with Unity game engine and any other C++ commercial or in-house game engine..",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2, d.o.o. (an Outfit7 subsidiary) or Outfit7 Limited for an indefinite period of time, with a six-month probationary period.\n- The position is based in Ljubljana (Slovenia) or in Limassol (Cyprus).\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Principal Software Engineer / Razvijalec informacijskih sistemov V (M/Ž)",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so izkušnje iz razvijanja programske opreme (mobilne igre). Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 27.02.2026",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Technology & Development",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Tetiana Nevmerzhytska",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7598892003,
      "updated_at": "2026-01-28T03:14:39-05:00",
      "requisition_id": "455",
      "title": "Principal Game Developer (Principal Software Engineer)",
      "company_name": "Outfit7",
      "first_published": "2026-01-21T04:01:41-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7588147003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5700567003,
      "location": {
        "name": "Ljubljana, Slovenia"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Advertising",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "We are looking for a seasoned and skilled Senior Business Development Expert to join our international mobile game development team. As a member of the Business Development department, you will be an expert in establishing, managing, and upgrading our relationships with app stores, publishing platforms, and key industry partners.\nIn this role, you will use your broad knowledge to influence direction and create innovative solutions that contribute to achieving company goals. We are looking for a professional who can recognize company-wide opportunities and impact our most important projects. We value a solution-oriented mindset and the ability to navigate complex business relations in a results-oriented environment.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Manage and upgrade company relationships with app stores and publishing platforms to optimize business performance.\n- Initiate and manage demanding cross-departmental projects from ideation through execution.\n- Recognize company-wide opportunities and provide an analytical perspective to help prioritize work based on business impact.\n- Propose the most optimal solutions for challenging situations while keeping business needs and company goals in mind.\n- Partner with different business segments, including production, distribution, and sales, to ensure alignment.\n- Maintain familiarity with regulatory and legal concerns by working closely with the company’s Legal department.\n- Find innovative ways to perform work and propose improvements to tools and workflows as needed.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Being able to understand the “big picture” of the most challenging projects and how they connect with department and company goals.\n- Skills to adapt communication styles for various audiences and clearly communicate actionable insights and expert reasoning to company leadership.\n- Capability to design project frameworks from scratch and define required project roles.\n- The ability to work independently and run projects from start to finish.\n- A positive attitude that encourages cooperation, values diverse perspectives, and builds long-term internal and external relationships.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 5+ years in a growth, business development, store relations, or related domain.\n- Prior experience in mobile gaming or managing app store partnerships.\n- A track record of taking large-scale projects from start to finish.\n- Experience in identifying potential risks, evaluating relevant business factors, and implementing solutions.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2 d.o.o. for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Strokovnjak za razvoj poslovanja (M/Ž)",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so izkušnje iz razvoja poslovanja. Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 30.1.2026.",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Sales & Business Development",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Neja Rozman",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7588147003,
      "updated_at": "2026-01-23T03:19:06-05:00",
      "requisition_id": "453",
      "title": "Senior Business Development Expert",
      "company_name": "Outfit7",
      "first_published": "2026-01-13T06:36:34-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7518572003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5674632003,
      "location": {
        "name": "Ljubljana, Slovenia"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Talking Tom and Friends",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "As a Director of Game Design, you’ll set the creative bar and lead a passionate team of designers in shaping unforgettable gameplay experiences across all Talking Tom & Friends titles. You’ll set and maintain the highest standards of design excellence, ensuring every game embodies creative vision and commitment to quality. Beyond creative leadership, you’ll empower your team to thrive by guiding their growth, aligning goals, supporting individual development, and contributing to business success.\n\nReady to lead, inspire, and elevate the future of play? Let’s make it happen.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Set clear Game Design department vision and goals that are aligned with company plans, target audience expectations, and market trends.\n- Build and lead a high-performing team of talented game designers.\n- Cooperate with cross-department teams including product managers, UX, game art, and distribution.\n- Drive the team to design and deliver projects that match the intended game experience for the Talking Tom & Friends target audience.\n- Act as a source of support, knowledge, and experience for the game design team.\n- Lead regular performance reviews, deliver constructive feedback, and actively support the professional development of team members\n- Improve the game design workflow with new approaches, and share knowledge with the team and with peers.\n- Keep up to date with current mobile market trends and game design practices.\n- Foster a culture of efficiency, innovation, and knowledge sharing.\n- Enable the team to constantly improve development processes based on technological advancements and industry trends. \n- Identify hiring needs and drive the hiring process to acquire and onboard new top talent.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Passion for mobile games.\n- Creative, innovative mindset, with strong logical and analytical thinking, and good attention to detail.\n- Good understanding of player behaviors and motivations across target audiences.\n- Good understanding of mobile game trends, best practices, and technologies.\n- Knowledge of Freemium/free-to-play (F2P) games is a must.\n- Excellent skills in team leadership, resource planning, communication, problem solving, and conflict resolution, and strong interpersonal skills.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 5+ years of experience as the manager of a game design team.\n- 5+ years of experience as a game designer.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2 d.o.o. for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Menedžer v oddelku Načrtovanje iger V",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so izkušnje z razvojem mobilnih iger. Ponujamo vam delovno razmerje za nedoločen čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok prijave: 30.01.2026",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Game & UX Design",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Tetiana Nevmerzhytska",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7518572003,
      "updated_at": "2026-01-02T06:32:51-05:00",
      "requisition_id": "444",
      "title": "Senior Director of Game Design",
      "company_name": "Outfit7",
      "first_published": "2025-11-12T06:21:21-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7523994003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5676700003,
      "location": {
        "name": "Ljubljana, Limassol"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Talking Tom and Friends",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "2",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "Do you want to work with a talented team developing mobile games?\n\nThen you might be the experienced game developer we’re looking for to help us maintain and further improve the portfolio of award-winning games like My Talking Angela 2, My Talking Tom 2 and My Talking Tom Friends 2. In addition, you will eventually work on developing new games across the franchise. Our ideal candidate will cover everything from delving deep into game and engine code to implementing new features; all with a proactive, lead-by-example attitude.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Plan and implement game features and components for live mobile games using in-house Starlite game engine written in C++ or Unity game engine (depends on department needs during onboarding phase).\n- Collaborate, communicate, and work efficiently as part of the multidisciplinary team, and across various other internal departments and the Starlite engine team.\n- Maintain and improve game code, libraries and tools for artists and designers.\n- Learn more about Starlite game engine from Outfit7 Tech Blog:  Building the Ultimate Mobile Game Engine: Starlite https://outfit7.com/blog/tech/building-the-ultimate-mobile-game-engine-starlite",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Good communication and interpersonal skills, with fluency in the English language (both written and spoken).\n- Positive, make-it-happen, lead-by-example attitude.\n- Proactive working style, with the ability to work in a fast-paced environment with tight deadlines and short production pipeline life-cycles.\n- Technical team lead experience is an advantage (implementation planning, tasks delegation, coordinating with other disciplines, mentoring less experienced developers, etc.) \n- Keen to learn new technologies and gain new skills.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 8+ years of professional experience in game development.\n- Excellent technical background (emphasis is on game engine architecture, performance optimisation and graphics pipeline).\n- Proficient in C++ and C# programming.\n- Professional experience with Unity game engine and any other C++ commercial or in-house game engine..",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2, d.o.o. (an Outfit7 subsidiary) or Outfit7 Limited for an indefinite period of time, with a six-month probationary period.\n- The position is based in Ljubljana (Slovenia) or in Limassol (Cyprus).\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Senior Software Engineer / Razvijalec informacijskih sistemov IV (M/Ž)",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so izkušnje iz razvijanja programske opreme (mobilne igre). Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 30.01.2026",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Technology & Development",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Tetiana Nevmerzhytska",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7523994003,
      "updated_at": "2026-01-02T06:33:24-05:00",
      "requisition_id": "446",
      "title": "Senior Game Developer (Senior Software Engineer)",
      "company_name": "Outfit7",
      "first_published": "2025-11-11T05:52:11-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7597620003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5704668003,
      "location": {
        "name": "ljubljana"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Marketing",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "Where data meets decisions!\nJoin us as a Senior Marketing Data Scientist and turn complex data into smarter marketing moves. From experimentation frameworks to profitability models, you’ll contribute to success and help shape data-driven marketing at Outfit7.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Collaborate with Distribution and Product teams to identify opportunities to improve distribution.\n- Proactively discover and drive new data-driven approaches to optimize distribution.\n- Work on ad hoc projects that support company strategy.\n- Present and share new methodologies and best practices internally and externally.\n- Build and maintain clean, scalable data pipelines and internal tools that reduce manual work, minimize errors, and enable at-scale optimization.\n- Develop robust experimentation frameworks and perform analyses to support profit growth and distribution optimization.\n- Communicate insights clearly, challenge outdated practices, and lead pragmatic improvements.\n- Optimize data processing workflows to improve efficiency and performance.\n- Advise the Marketing team on test design and experimental setups based on data insights.\n- Contribute analytical perspectives to discussions and suggest improvements to campaign performance.\n- Analyze results from various experiments and tests.\n- Implement mathematical models to optimize the performance of Outfit7's marketing campaigns.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Strong problem-solving skills with the ability to understand data and identify key trends.\n- Advanced data analysis skills, particularly in SQL and R or Python.\n- Ability to work efficiently in a fast-changing environment.\n- Excellent communication and presentation skills; fluent in English (written and spoken).\n- Proven ability to structure complex problems, conduct thorough analyses, and generate actionable insights from large datasets.\n- Proficiency in reporting and explaining complex results to stakeholders from diverse professional backgrounds.\n- Excellent attention to detail and a continuous-improvement mindset.\n- A positive, proactive, lead-by-example attitude.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 5+ years of experience in a data scientist role, ideally in mobile gaming, performance marketing or related fields (you should know how to use data to help with business decisions). \n- Proficiency in R or Python, primarily for statistical analysis, data manipulation, and visualisation.\n- Experience with data analysis, reporting, and monitoring.\n- Experience with data-oriented tools, such as SQL; familiarity with DBT is a plus.\n- Proven ability to structure complex problems, conduct thorough analyses, and generate actionable insights from large datasets.\n- Experience working with teams from different departments.\n- Experience in leading a smaller team would be a plus.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2 d.o.o. for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal company policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Marketinški podatkovni analitik IV. (M/Ž)",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so izkušnje iz področja podatkovne znanosti, idealno v performance marketingu, mobilnih igrah ali sorodnih področjih. Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 28.2.2026.",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Marketing & Publishing",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Neja Rozman",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7597620003,
      "updated_at": "2026-01-22T08:46:41-05:00",
      "requisition_id": "454",
      "title": "Senior Marketing Data Scientist",
      "company_name": "Outfit7",
      "first_published": "2026-01-22T05:33:27-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7564281003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5690804003,
      "location": {
        "name": "Ljubljana, Slovenia"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Talking Tom and Friends",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "We're on the hunt for a Senior Product Manager with deep knowledge of the mobile gaming landscape to lead the implementation of compelling game titles. If you're passionate about game experiences that resonate with players, blending business with creativity, and driving a product's journey from concept to launch, we want you!",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Work efficiently with other teams – GD, UX, Analytics, Marketing, Development, and Art – on a daily basis, researching, and implementing the vision of new and existing games.\n- Drive and guide the team regarding which ideas to pursue, using expertise, clear reasoning, and a deep understanding of the market and of the business goals.\n- Ensure the delivery of agreed-upon output by setting priorities, maintaining focus, and asking the right product questions.\n- Understand the vision of the game, and communicate it clearly to the team and to stakeholders.\n- Provide the team with suggestions and solutions for improving ideas and game features.\n- Maintain and prioritise the ideas and features backlog.\n- Identify and implement ways to improve working practices in the department in order to increase efficiency, focus on the right priorities, and maintain a positive and collaborative atmosphere.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Deep understanding of the mobile games market, including current developments and best practices.\n- Ability to understand analytics reports, KPIs, and user research, and use these tools to make informed decisions.\n- Ability to independently troubleshoot, prioritise, and address challenges that arise during the product lifecycle.\n- Proficiency with tools like JIRA and Trello, or other project management software.\n- Excellent ability to balance business, creative needs, timelines, and user experience in the creation of new games.\n- Strong communication skills, with fluency in the English language (both written and spoken).\n- First-rate interpersonal skills, with the ability to communicate effectively with colleagues and partners.\n- Ability to focus on the bigger picture  while simultaneously paying close attention to details.\n- Ability to prepare presentations, product specifications, and work on product requirements.\n- Passion for mobile games and an excellent understanding of player needs.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- Proven experience in launching mobile games in a Product Manager or similar role.\n- At least 5 years of experience working in game production (casual mobile games are a plus).\n- Knowledge of freemium/free-to-play (F2P) games and various monetization models.\n- Experience in cross-departmental collaboration.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2 d.o.o. for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office\n- Flexible working hours\n- 24 days of paid vacation\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Senior Product Manager / Produktni menedžer IV",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so bogate izkušnje iz produktnega menedžmenta. Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 28.2.2025",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Product & Production",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Tetiana Nevmerzhytska",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7564281003,
      "updated_at": "2025-12-16T04:12:11-05:00",
      "requisition_id": "451",
      "title": "Senior Product Manager",
      "company_name": "Outfit7",
      "first_published": "2025-12-16T04:12:11-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7515790003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5673518003,
      "location": {
        "name": "Ljubljana"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Technology",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "We're looking for a hands-on Senior System Administrator to lead and evolve our IT infrastructure. You'll guide a small team, set the technical direction, and keep our systems secure, scalable, and reliable. From servers and networks to cloud and endpoint management — you'll be the expert ensuring everything runs smoothly and efficiently.",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Lead and mentor the IT Infrastructure area, providing guidance and setting the technical direction.\n- Define and execute an infrastructure strategy that supports the company’s growth, security, and operational goals.\n- Manage all core systems, including physical servers, network equipment, virtualization, Wi-Fi infrastructure, and backups.\n- Design and maintain secure network setups, including VLANs, firewalls, VPNs, and WiFi (Ruckus, Ubiquiti, or similar).\n- Ensure strong cybersecurity practices: patching, access control, backups, and endpoint protection.\n- Manage network services such as DHCP, DNS, VPN, and SSO, keeping systems fast, stable, and reliable.\n- Experience managing end-user devices (macOS and Windows), familiarity with Kandji and Intune, is a plus.\n- Work closely with other teams on projects, integrations, and automation improvements.\n- Evaluate and introduce new tools or technologies that improve productivity and scalability.\n- Assisting with IT audits (documentation, policies, DRP, DPP, etc.).",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Experience leading a small team and coordinating activities across the whole IT infrastructure area.\n- Strong project management skills with a proactive, hands-on mindset.\n- Excellent time management and the ability to balance strategy with day-to-day work.\n- Solid troubleshooting and problem-solving abilities across multiple platforms.\n- Clear communication skills and fluency in English.\n- Scripting knowledge — Bash is essential; Python or PowerShell is a plus.\n- Strong understanding of IT security principles and practical experience applying them.\n- A positive, can-do attitude and the ability to lead by example.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 5+ years in system administration or infrastructure management.\n- Proven experience managing Ubuntu/Linux servers in production environments.\n- Comfortable working in mixed macOS and Windows setups.\n- Hands-on experience with Kandji (or similar MDM) and Intune (or similar).\n- Good networking knowledge (Cisco, Opnsense, Ubiquiti, Ruckus) and firewall management.\n- Experience implementing IT security frameworks, policies, or compliance standards.\n- Previous experience leading or mentoring IT staff is a big plus\n- Familiarity with cloud platforms like AWS, Azure, or Google Cloud is an advantage.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2 d.o.o. for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal company policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Sistemski skrbnik IV. (Ž / M)",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so izkušnje iz razvoja informacijskih sistemov. Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 30.1.2026.",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Technology & Development",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Neja Rozman",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7515790003,
      "updated_at": "2026-01-06T05:28:39-05:00",
      "requisition_id": "442",
      "title": "Senior System Administrator",
      "company_name": "Outfit7",
      "first_published": "2025-11-03T07:47:48-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/6685260003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5255636003,
      "location": {
        "name": "ljubljana"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Marketing",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "Full-funnel UA is your playground, and you know every corner — from big-picture vision to hands-on execution. You live for the challenge of managing and optimizing campaigns, squeezing every ounce of performance from every channel. Data isn’t just numbers to you — it’s the map to your next breakthrough, guiding cross-functional collaboration and sparking ideas that scale. Ready to transform traffic into traction and planning into unstoppable growth? Then get in touch!",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Execute user acquisition (UA) strategies for games at all stages of development, including prototyping, soft launch, and global release — with a focus on titles driven by in-app purchases (IAP) or subscriptions.\n- Manage the UA strategy for each product based on its specific goals and lifecycle stage.\n- Plan, launch, and optimize UA campaigns to meet key performance indicators (KPIs) and drive scalable growth.\n- Collaborate closely with product, creative, and analytics teams to design and execute tests that enhance both user acquisition effectiveness and overall product performance.\n- Analyze campaign performance data to uncover insights and continuously improve both UA efficiency and return on investment.\n- Stay informed on industry trends, emerging platforms, and market shifts in order to proactively identify opportunities and mitigate potential risks.\n- Share knowledge, insights, and best practices across teams to support personal and collective growth in UA capabilities.\n- Candidate with experience as a lead would be considered in a hybrid role, also  leading a small team of User Acquisition experts.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Deep understanding of user acquisition strategies and best practices within the mobile app ecosystem.\n- Strong passion for performance marketing, with a focus on data-driven growth.\n- Analytical mindset with the ability to extract actionable insights, identify trends, and detect anomalies in complex datasets.\n- Solid grasp of predictive models such as Lifetime Value (LTV) and Return on Ad Spend (ROAS).\n- Skilled at setting clear priorities based on potential impact and business value.\n- Strong communication skills, with fluency in English, both written and spoken.\n- Nice to have: Ability to manage not only your own responsibilities, but also those of a broader team.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 5+ years of hands-on experience in user acquisition for in-app purchase (IAP) or subscription-based mobile games or apps.\n- Proven track record of managing products through multiple lifecycle stages — from prototype and soft launch to global launch — is a strong advantage.\n- Demonstrated success in optimizing campaigns toward Return on Ad Spend (ROAS).\n- Experience in managing and scaling campaigns across a variety of channels, including Meta, Google Ads, TikTok, - Apple Search Ads (ASA), and ad networks, and in working with mobile measurement partners (MMPs).\n- Familiarity with privacy regulations and data limitations, including experience optimizing campaigns without access to user-level data on post-install events/ROAS.\n- Experience in leading a team of other UA experts is a plus, but not a requirement.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2 d.o.o. for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal company policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Strokovnjak za pridobivanje uporabnikov IV. (M/Ž)",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so izkušnje iz področja podatkovne analitike. Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 30.1.2026.",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Marketing & Publishing",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Neja Rozman",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 6685260003,
      "updated_at": "2025-12-16T09:31:08-05:00",
      "requisition_id": "424",
      "title": "Senior User Acquisition Expert",
      "company_name": "Outfit7",
      "first_published": "2025-08-20T05:52:37-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/6678121003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5252202003,
      "location": {
        "name": "Ljubljana, Slovenia"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Cell",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "As a visual effects artist, there’s nothing you can’t do. You can use particle systems (from explosions to flares), dazzle the world with animated sequences, and work your magic with advanced materials, create a UI of any complexity and make it live and amazing. \nRight now, there’s just one thing between you and greatness – applying for this job!",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Produce visual effects for our games, both for gameplay and UI.\n- Follow concept art, storyboards, and written descriptions in order to prototype and implement FX in our games.\n- Work closely with UI/UX directly in Figma and export assets to Unity.\n- Organize Assets flow, correct naming and prefabs structure in both Figma and Unity.\n- Collaborate with the Art Director to help create and maintain FX art direction for our games.\n- Work closely with the internal art and programming teams.\n- Create FX textures, using simple geometry and UVs.\n- Optimize FX for frame rate and memory usage.\n- Produce optimized materials/shaders.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Good communication and interpersonal skills, with fluency in the English language (both written and spoken).\n- Positive, make-it-happen attitude.\n- Proactive working style, with the ability to work in a fast-paced environment with tight deadlines and short production pipeline life-cycles.\n- Keen to learn new technologies and gain new skills.",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 5+ years of experience in game development.\n- Strong artistic and technical background (e.g. animation, game development, graphics, etc.).\n- Experience using Unity Editor or similar game engine.\n- Proficient skills with various software - Unity, Figma, Adobe Photoshop, AfterEffects, Premier, Autodesk Maya.\n- Basic shader and C# coding knowledge.\n- Experience with Houdini and writing shaders in CG or other shading languages is a plus.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2, d.o.o. (an Outfit7 subsidiary) for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Healthy meals in the office.\n- Flexible working hours.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Oblikovalec posebnih učinkov IV. (M/Ž)",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 18.12.2025",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Art & Animation",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Tetiana Nevmerzhytska",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid",
            "Remote"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 6678121003,
      "updated_at": "2025-12-10T07:18:24-05:00",
      "requisition_id": "420",
      "title": "Senior VFX Artist ",
      "company_name": "Outfit7",
      "first_published": "2025-08-11T05:02:40-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/5978177003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4946771003,
      "location": {
        "name": "Ljubljana, Slovenia"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "Technology",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "3",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "Fancy working on the cutting edge of web technology?\n\nWe’re looking for a Web developer to drive some of Outfit7 most ambitious and interactive web-based projects yet. You need to have the confidence and skill set to collaborate across multiple departments, taking innovative ideas all the way from a spark of inspiration to a fully functioning web experience. Sounds like you? Then get in touch!",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "- Plan, develop, and maintain full-stack web applications.\n- Work on varied projects, developing features and improvements for existing websites.\n- Develop interactive web pages that capture the spark of gameplay experiences and translate it to the web.\n- Work closely with teams across the company to transform new ideas into functional websites.\n- Research, investigate, and introduce new technologies.",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "- Excellent knowledge of Typescript, Node.js, and NestJS.\n- Experience with at least one modern Javascript framework (Vue 3 - preferred, React, or Angular).\n- Experience in project management.\n- Appreciation and a keen eye for good UI and UX\n- Experience with WebGL and Web Game Development is plus\n- Experience with integration of Web Payment APIs and Gateways is a plus\n- Ability to learn and embrace new technologies.\n- Positive, make-it-happen, lead-by-example attitude.\n- Ability to work efficiently as part of a dynamic team.\n- Excellent interpersonal and communication skills, with fluency in the English language (both written and spoken).",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "- 5+ years of experience building full-stack web applications.\n- Experience in writing efficient, clear, reusable code, and in following best practices for software development.",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "- Employment relationship with Ekipa2 d.o.o. (an Outfit7 subsidiary) for an indefinite period of time, with a six-month probationary period.\n- Diverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\n- Participation in attractive projects.\n- Development opportunities through training, seminars, and conferences.\n- Choice of sport, fitness, educational, and entertainment activities outside of work.\n- Work-life balance.\n- 24 days of paid vacation.\n- Participation in a discretionary bonus plan.\n- Christmas bonus (subject to internal company policies).",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": "Razvijalec informacijskih sistemov IV (M/Ž)",
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "Zahtevane so izkušnje iz razvijanja informacijskih sistemov (Web Full-stack Development). Sklenitev delovnega razmerja nudimo za nedoločen delovni čas s šestmesečnim poskusnim delom v podjetju Ekipa2 d.o.o., s sedežem v Ljubljani.\nRok za prijavo: 27.02.2026",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Technology & Development",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Tetiana Nevmerzhytska",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "Hybrid"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 5978177003,
      "updated_at": "2026-01-27T03:59:52-05:00",
      "requisition_id": "348",
      "title": "Senior Web Developer (Senior Software Engineer)",
      "company_name": "Outfit7",
      "first_published": "2024-05-14T04:42:10-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/outfit7/jobs/7492881003",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 5664140003,
      "location": {
        "name": "shanghai"
      },
      "metadata": [
        {
          "id": 27140153003,
          "name": "Division",
          "value": "China publishing",
          "value_type": "single_select"
        },
        {
          "id": 4045077003,
          "name": "Employment Type",
          "value": "Full-time",
          "value_type": "single_select"
        },
        {
          "id": 7481619003,
          "name": "Priority",
          "value": "1",
          "value_type": "single_select"
        },
        {
          "id": 4296002003,
          "name": "Publish - Description (Recruiter)",
          "value": "Would you love to make games enjoyed by hundreds of millions of players around the world?\n\nWe’re looking for a software engineer to join our team and help bring Outfit7 mobile games to life. You’ll work on exciting projects, collaborating with a creative, cross-functional team, crafting the features that keep the players coming back for more. If you can combine your technical expertise with strong people skills and a positive, proactive attitude, and you have a passion for delivering high-quality, market-leading games, then we want to hear from you now!\n\n你想亲手打造让全球数亿玩家喜爱的游戏吗？\n我们正在招募一名经验丰富的游戏开发人员加入团队，共同将我们的移动游戏变为现实。你将参与令人兴奋的项目，与富有创造力的跨职能团队紧密合作，设计和实现能够吸引玩家持续回归的功能和内容。\n如果你既有扎实的技术能力，又具备良好的沟通协作能力和积极主动的态度，并且热衷于打造高质量、引领市场的游戏，我们非常期待你的加入！",
          "value_type": "long_text"
        },
        {
          "id": 4310460003,
          "name": "Publish - Responsibilities (Recruiter)",
          "value": "Implement game features and components in Outfit7 most successful games.\nMaintain and improve game code and tools.\nIntegrate internal libraries.\nCollaborate, communicate, and work efficiently within your own team, and across teams throughout the company.\nAdjust and deploy Unity games  for the Chinese market.\n   \n\n\n岗位职责：\n负责我们最成功游戏的功能与组件实现。\n维护并优化游戏代码及工具。\n集成内部游戏库。\n在团队及跨部门协作中保持高效沟通与合作。\n负责中国市场TTF游戏版本的Unity端内容调整与发布。",
          "value_type": "long_text"
        },
        {
          "id": 4310461003,
          "name": "Publish - Required Skills (Recruiter)",
          "value": "Excellent communication and interpersonal skills (strong English language skills, both written and spoken, are a plus.)\nPositive, make-it-happen, lead-by-example attitude.\nAbility to work in a fast-paced, dynamic environment and to meet deadlines. \nStrong C# development skills and familiarity with Unity.\n\n任职要求：\n具备优秀的沟通和人际交往能力，英语书面及口语表达流畅者优先。\n积极主动、结果导向、以身作则的工作态度。\n能够适应快节奏、动态变化的工作环境并按时完成目标。\n熟练掌握C#开发技能, 对 Unity 引擎熟悉。",
          "value_type": "long_text"
        },
        {
          "id": 4310462003,
          "name": "Publish - Required Experience (Recruiter)",
          "value": "Unity/C# game development experience.\nStrong technical background (game development, programming, computer science, etc.)\nExperience with C++, various game engines, or shader programming are all pluses.\n   \n经验要求：\n拥有Unity/C#游戏开发经验。\n具备扎实的技术背景（游戏开发、编程、计算机科学等）。\n有C++、多引擎开发或Shader编写经验者优先。",
          "value_type": "long_text"
        },
        {
          "id": 4310463003,
          "name": "Pubish - What Do We Offer",
          "value": "Employment relationship with Outfit7 Network Technology Co., Ltd Shanghai Branch for a fixed term period of three years, with a six-month probationary period and the option to prolong the contract.\nDiverse work with exciting daily challenges, working as part of a team in a fun, relaxed environment.\nParticipation in attractive projects.\nDevelopment opportunities through training, seminars, and conferences.\nChoice of sport, fitness, educational, and entertainment activities outside of work.\nWork-life balance.\nOffice snacks and coffee\nParticipation in a discretionary bonus plan\nChristmas bonus (subject to internal company policies) \n\n\n我们提供\n\n与奥飞特七网络科技有限公司上海分公司签订为期三年的劳动合同，试用期六个月，三年合同期满后可选择续签无限期延长合同。\n一个年轻的团队，工作内容多元化，日常带来令人激动的各种挑战，工作环境有趣且轻松。\n参与有吸引力的项目。\n培训、论坛以及行业会议等职业发展机会。\n工作之余提供可选的运动、健身、教育以及娱乐活动。\n工作生活平衡。\n办公室下午茶。\n参与公司绩效奖金计划\n圣诞奖金（根据公司内部政策执行）",
          "value_type": "long_text"
        },
        {
          "id": 4310464003,
          "name": "Publish - Compensation",
          "value": null,
          "value_type": "long_text"
        },
        {
          "id": 4296009003,
          "name": "Publish - SLO Title (Recruiter)",
          "value": null,
          "value_type": "short_text"
        },
        {
          "id": 4296010003,
          "name": "Publish - SLO Descritpion (Recruiter)",
          "value": "/",
          "value_type": "long_text"
        },
        {
          "id": 5685054003,
          "name": "Job category (area)",
          "value": "Technology & Development",
          "value_type": "single_select"
        },
        {
          "id": 14447584003,
          "name": "Recuiter to display",
          "value": "Dan Li",
          "value_type": "single_select"
        },
        {
          "id": 25298087003,
          "name": "Work Type",
          "value": [
            "On-site"
          ],
          "value_type": "multi_select"
        }
      ],
      "id": 7492881003,
      "updated_at": "2025-12-04T05:06:13-05:00",
      "requisition_id": "439",
      "title": "Software Engineer (Game Development)",
      "company_name": "Outfit7",
      "first_published": "2025-10-09T05:09:31-04:00",
      "language": "en"
    }
  ]
}