{
  "company": "struck",
  "fetched_at": "2025-10-31T03:52:11.164695",
  "job_count": 1,
  "jobs": [
    {
      "absolute_url": "https://job-boards.greenhouse.io/struck/jobs/7176953",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 3222203,
      "location": {
        "name": "SLC"
      },
      "metadata": [
        {
          "id": 49768,
          "name": "Description Summary",
          "value": "We need a contract designer who deeply understands the people they are designing for and thrives in transforming ideas into impactful visual experiences, whether physical, spatial, or digital. You are multifaceted, collaborative, and unlike other problem solvers. Your experience spans everything from websites, brand identities, and physical environments to immersive installations and experiential branding.",
          "value_type": "long_text"
        },
        {
          "id": 160451,
          "name": "We Need",
          "value": "We Need...\nWe are looking for a contract designer who deeply understands the people they are designing for and thrives in transforming ideas into impactful visual experiences, whether physical, spatial, or digital. You are multifaceted, collaborative, and unlike other problem solvers. Your experience spans everything from websites, brand identities, and physical environments to immersive installations and experiential branding. You put user outcomes at the center of your work and partner in our clients’ success. You are a team player who commits to a cross-discipline way of working, constantly empathizing, iterating, and seeking inspiration in unexpected places.",
          "value_type": "long_text"
        },
        {
          "id": 160453,
          "name": "Column 1",
          "value": "You Have...\n5+ years of visual design experience—Agency Experience Preferred\nAn exceptional portfolio demonstrating your knowledge of branding and a deep understanding of color, type, composition, and physical space.\nStrong experience collaborating with teams in an agency environment.\nHighly conceptual thinking paired with outstanding execution skills in both digital and physical environments.\nDirect client interaction experience, with the finesse to understand objectives and identify creative solutions.\nThe ability to clearly articulate your thinking behind creative solutions. You communicate successfully with other team members and during presentations to our clients.\nStrong collaboration skills. You understand the importance of working together, with people from different backgrounds and specializations, to solve problems.\nExperience in environmental, spatial, or branded experience design is strongly preferred.\nAn ability to stay up-to-date on the latest trends in digital design and physical experiences.\nA Bachelor’s degree or equivalent experience in a related field.",
          "value_type": "long_text"
        },
        {
          "id": 160454,
          "name": "Column 2",
          "value": "You Will...\nTake Initiative: You believe that you can and will come up with creative solutions to big problems, with confidence that all it takes is rolling up your sleeves and diving in.\nPractice Radical Collaboration: You know that collaboration is more than conference calls and video chats; it’s discovering our individual passions and fighting to give one another ways to show it. You are a role model for radical collaboration, building trust, respect, and shared ownership across the team.\nDesign for Branded Experience: You bring brand stories to life in the built world -  whether through signage, installations, environmental graphics, or other other immersive design - that shape how people experience a space.\nBuild Empathy with Clients and Users: You have the ability to step into other people’s shoes, understand their lives, and solve problems from their perspectives. You believe the people you’re designing for are your roadmap to innovative solutions.\nIterate and Prototype: You recognize that no solution is perfect and treat everything as a prototype. Using human-centered design, your bias is toward action, creating concepts that can be tested and refined.\nAbility to work under tight deadlines in a dynamic, fast-moving environment.",
          "value_type": "long_text"
        },
        {
          "id": 160455,
          "name": "Column 3",
          "value": "Contract Details\nThis is a 20-month, full-time contract position based in Salt Lake City. 30 hours a week.\n\n\nAt the end of the contract term, there may be opportunities for extension or transition based on business needs and performance.",
          "value_type": "long_text"
        }
      ],
      "id": 7176953,
      "updated_at": "2025-08-18T19:19:42-04:00",
      "requisition_id": null,
      "title": "Contract Designer",
      "company_name": "Struck",
      "first_published": "2025-08-18T19:01:03-04:00",
      "language": "en"
    }
  ]
}