{
  "company": "struck",
  "fetched_at": "2025-11-09T03:51:11.786058",
  "job_count": 1,
  "jobs": [
    {
      "absolute_url": "https://job-boards.greenhouse.io/struck/jobs/7379167",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 3289713,
      "location": {
        "name": "SLC"
      },
      "metadata": [
        {
          "id": 49768,
          "name": "Description Summary",
          "value": "We need... an Executive Producer to lead the planning, management, and execution of large-scale branded experience projects - from concept through fabrication and installation. You’ll bridge creative vision and operational delivery, working closely with Creative Directors, Architects, Designers, and Production Partners to ensure that each project maintains design integrity, stays on schedule, and delivers extraordinary experiences.",
          "value_type": "long_text"
        },
        {
          "id": 160451,
          "name": "We Need",
          "value": "We Need...\nWe’re looking for an Executive Producer to lead the planning, management, and execution of large-scale branded experience projects - from concept through fabrication and installation. You’ll bridge creative vision and operational delivery, working closely with Creative Directors, Architects, Designers, and Production Partners to ensure that each project maintains design integrity, stays on schedule, and delivers extraordinary experiences.",
          "value_type": "long_text"
        },
        {
          "id": 160453,
          "name": "Column 1",
          "value": "You Have...\n8+ years of experience in experiential, architectural, or environmental design project management.\nProven success managing large, multi-disciplinary projects. \nDeep understanding of production, fabrication, and installation processes.\nExcellent communication, leadership, and organizational skills.\nAbility to manage multiple complex projects simultaneously.\nStrong client presence and calm under pressure.\nBackground in creative agency, experiential, design/fabrication, or architectural environments preferred.\nFamiliarity with AIA contracts, permitting, and construction documentation preferred.\nExperience with design development, fabrication, and vendor management.\nUnderstanding of budgeting tools and financial forecasting.",
          "value_type": "long_text"
        },
        {
          "id": 160454,
          "name": "Column 2",
          "value": "You Will...\nLead day-to-day management of complex experiential, environmental, and architectural design projects.\nPartner with Creative, Strategy, and Technical teams to define project scope, budgets, and schedules.\nOversee all phases from creative development and design to fabrication, construction, and installation.\nManage vendor relationships, bids, and contracts, ensuring quality and accountability throughout.\nAct as the main client contact, communicating progress, milestones, and risks with clarity and confidence.\nAnticipate challenges and proactively solve problems to maintain momentum and protect creative integrity.\nPartner with internal leadership to refine processes, identify efficiencies, and mentor mid-level producers.\nSupport business development and proposal efforts with scoping, resourcing, and cost estimating.",
          "value_type": "long_text"
        },
        {
          "id": 160455,
          "name": "Column 3",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 7379167,
      "updated_at": "2025-11-05T19:29:10-05:00",
      "requisition_id": null,
      "title": "Executive Producer",
      "company_name": "Struck",
      "first_published": "2025-11-05T19:29:10-05:00",
      "language": "en"
    }
  ]
}