{
  "company": "struck",
  "fetched_at": "2026-02-22T04:54:35.664064",
  "job_count": 1,
  "jobs": [
    {
      "absolute_url": "https://job-boards.greenhouse.io/struck/jobs/7540222",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "education": "education_optional",
      "internal_job_id": 3338228,
      "location": {
        "name": "SLC"
      },
      "metadata": [
        {
          "id": 49768,
          "name": "Description Summary",
          "value": "We need a Utah based designer who deeply understands the people they are designing for and thrives in transforming ideas into impactful visual experiences, whether digital, physical, or spatial. You are multifaceted, collaborative, and unlike other problem solvers. Your experience spans everything from websites, brand identities, and physical environments to immersive installations and experiential branding. You put user outcomes at the center of your work and partner in our clients’ success. You are a team player who commits to a cross-discipline way of working, constantly empathizing, iterating, and seeking inspiration in unexpected places.",
          "value_type": "long_text"
        },
        {
          "id": 160451,
          "name": "We Need",
          "value": "We Need...\nWe are looking for a Utah based designer who deeply understands the people they are designing for and thrives in transforming ideas into impactful visual experiences, whether digital, physical, or spatial. You are multifaceted, collaborative, and unlike other problem solvers. Your experience spans everything from websites, brand identities, and physical environments to immersive installations and experiential branding. You put user outcomes at the center of your work and partner in our clients’ success. You are a team player who commits to a cross-discipline way of working, constantly empathizing, iterating, and seeking inspiration in unexpected places.",
          "value_type": "long_text"
        },
        {
          "id": 160453,
          "name": "Column 1",
          "value": "You Have...\nMust be located in Utah.\n5+ years of visual design experience—Agency Experience Preferred.\nAn exceptional portfolio demonstrating your knowledge of digital and branding work. \nA required in-depth knowledge of Figma.\nUnderstanding of color, type, composition, and physical space.\nStrong experience collaborating with teams in an agency environment.\nHighly conceptual thinking paired with outstanding execution skills in both digital and physical environments.\nDirect client interaction experience, with the finesse to understand objectives and identify creative solutions.\nThe ability to clearly articulate your thinking behind creative solutions. You communicate successfully with other team members and during presentations to our clients.\nStrong collaboration skills. You understand the importance of working together, with people from different backgrounds and specializations, to solve problems.\nExperience in environmental, spatial, or branded experience design is preferred.\nAbility to work under tight deadlines in a dynamic, fast-moving environment.",
          "value_type": "long_text"
        },
        {
          "id": 160454,
          "name": "Column 2",
          "value": "You Will...\nTake Initiative: You believe that you can and will come up with creative solutions to big problems, with confidence that all it takes is rolling up your sleeves and diving in.\nPractice Radical Collaboration: You know that collaboration is more than conference calls and video chats; it’s discovering our individual passions and fighting to give one another ways to show it. You are a role model for radical collaboration, building trust, respect, and shared ownership across the team.\nDesign for Branded Experiences: You bring brand stories to life in the built world—whether through signage, installations, environmental graphics, or other immersive design touchpoints that shape how people experience a space.\nBuild Empathy with Clients and Users: You have the ability to step into other people’s shoes, understand their lives, and solve problems from their perspectives. You believe the people you’re designing for are your roadmap to innovative solutions.",
          "value_type": "long_text"
        },
        {
          "id": 160455,
          "name": "Column 3",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 7540222,
      "updated_at": "2026-01-14T17:45:20-05:00",
      "requisition_id": null,
      "title": "Senior Designer",
      "company_name": "Struck",
      "first_published": "2026-01-14T17:45:20-05:00",
      "language": "en"
    }
  ]
}