{
  "company": "thetradedesk",
  "fetched_at": "2026-02-13T05:03:38.468480",
  "job_count": 124,
  "jobs": [
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5033765007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "education": "education_required",
      "internal_job_id": 4583908007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Interns",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5033765007,
      "updated_at": "2026-01-26T01:12:38-05:00",
      "requisition_id": null,
      "title": "2026 Australia Software Engineering Internship",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-26T01:11:25-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4828165007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "education": "education_required",
      "internal_job_id": 4474384007,
      "location": {
        "name": "Shanghai"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Interns",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "What we do:\nOptimization: How do we decide what ads to show to who and when to maximize the return on investment for an advertising campaign? How do we apply that decision making algorithm 11 million times per second, for thousands of advertising campaigns at once?\nForecasting: Can we predict with confidence how many people will be reached by an advertising campaign, and how much it will cost to reach them? Can we do that months in advance?\nExperimental design: How do we measure the impact of any changes we introduce to our optimization models? How do we quantify any tradeoffs those models may introduce (e.g., you pay more for each ad impression, but each impression is more valuable)?\nCausal inference: How do we determine what ads are performing best? What does it mean to have a high performing campaign? (Hint: clicks aren't the answer!)\nMachine Learning: How can we predict demographic information or interest of a given user by natural language processing and machine learning over hundreds of millions of web pages, graph mining and algorithmic optimization on petabytes of data.\n\nWhat you’ll do:\nOwn a meaningful project. Have the opportunity to contribute to the development of new and existing data products, experiencing firsthand the day-to-day life of a professional data scientist. We believe strongly in ownership at The Trade Desk, and we are committed to you having something substantial to show for your time here that will make a positive impact for the team.\nReceive one-on-one mentorship from an experienced Data Scientist and members of the Data Science team.\nCollaborate with a globally-connected team where you will also interact closely with our product, trading, and engineering teams to oversee the implementation of your projects.\n\nWho you are:\nYou might be a great fit for a Data Science internship at The Trade Desk if you\nAre enthusiastic to learn (and teach) new technologies, machine learning techniques, and advancements in the AdTech industry.\nHave an abundance of intellectual curiosity.\nHave a deep understanding of statistical machine learning and optimization techniques.\nWant to work with big data technologies such as Spark and AWS.\nHave experience in at least one programming language (Python, R, Java, Scala, etc.) and are comfortable with SQL by the start of the internship.\nAre able to deliver a convincing story, derived from data, to both technical and non-technical audiences.\nAre enrolled in a Master's or PhD degree program.\nHave an expected graduation date between Fall 2024 and Summer 2025.\nCan work in our Shanghai office for the duration of your internship. \n\nWhat you’re looking for:\n\nDo you want to work on a meaningful and impactful project that makes a difference? Are you eager to innovate? Do you want unique, large-scale, and highly complex challenges involving technology that is brand-new to you?\n\nWhat and how you can contribute is what’s important to us. Our consideration is not limited by the kind of education you have or the specific technologies you have experience with. We care about having good people to pitch in. Our culture is creative, energetic, and collaborative. Those aren’t perks – those are just the way we do business.\n\nIf this sounds like you, we welcome your application and invite you to find out why The Trade Desk has been named to the Fortune Future 50 list and the list of 100 fastest growing companies as well as Yello naming The Trade Desk a Top 100 Internship Program of 2023 and why we received the Intern Growth Award!\n\n#LI-PL1",
          "value_type": "long_text"
        }
      ],
      "id": 4828165007,
      "updated_at": "2025-12-18T07:32:11-05:00",
      "requisition_id": null,
      "title": "2026 China Data Science Internship - Deep Learning Focus (Based in Shanghai)",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-14T03:50:10-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4828142007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "education": "education_required",
      "internal_job_id": 4474374007,
      "location": {
        "name": "Shanghai"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Interns",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "What you’ll do               \n\nYou'll own and deliver a complete software project, participating actively in all stages of design, development, and delivery. At The Trade Desk, we value ownership and are dedicated to ensuring that your time here leads to a significant and impactful contribution for the team. \n\nReceive close, one-on-one mentorship from an experienced software engineer   \n\nCollaborate with a globally connected team of engineers, Interns & other teams and departments in cities across the world   \n\nWork with new technologies across a wide spectrum of computer science, including distributed systems, petabyte-scale data processing, machine learning/AI, and UI/UX  \n\n \n\n  \n\nWho you are  \n\nYou are fluent in one or more modern programming languages, eg, Javascript, Python, Java, PHP, C and C++, SQL \n\nHave a firm grasp on basic data structures and algorithmic techniques  \n\nYou are comfortable working on an agile, distributed team spanning multiple time zones and continents. \n\nYou have experience of software projects. \n\nYou are a quick and self-directed learner. We provide close support and mentorship, but you will have ownership over the design, plan, and implementation of what you build.  \n\nYou value, seek out, and foster diversity. We are a global team from many diverse backgrounds, with different experiences and perspectives. To complement this team, you will welcome ideas that are different from your own and be skilled at finding and building from common ground. \n\nCurrently enrolled in a Bachelor’s or Master’s degree program in Computer Science, Engineering, or a related field. \n\nAnticipated graduation date between November 2026 and August 2027. \n\nAvailability to work for 12 weeks during Summer 2026 (June–August) in Shanghai\n\nOpen to the possibility of rejoining The Trade Desk Shanghai office and same team for a future SWE full-time position.",
          "value_type": "long_text"
        }
      ],
      "id": 4828142007,
      "updated_at": "2026-02-06T04:12:34-05:00",
      "requisition_id": null,
      "title": "2026 China Software Engineering Internship (Based in Shanghai)",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-14T01:27:41-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4844796007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "education": "education_required",
      "internal_job_id": 4482742007,
      "location": {
        "name": "Madrid"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Interns",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4844796007,
      "updated_at": "2026-01-14T06:09:53-05:00",
      "requisition_id": null,
      "title": "2026 Madrid Software Engineering Internship",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-14T06:09:53-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5041449007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "education": "education_required",
      "internal_job_id": 4587784007,
      "location": {
        "name": "Bellevue; New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Interns",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "The Trade Desk is a global technology company with a mission to make the Internet better for everyone – consumers, content owners, and marketers – through principled, intelligent advertising. \n\nOur platform operates at an unprecedented scale. Handling over 12 million+ requests per second, we process more queries than searches on Google, tweets on Twitter, and snaps on Snapchat combined. It doesn't get much bigger or faster than this. And after 10+ years of being among the fastest growing companies in the world, we are still just getting started... \n\nWe have also built something even stronger and more valuable: an award-winning culture based on trust, empathy, collaboration, and ownership. We only hire the people who want to work well with others and enjoy building massively scalable software products. Every day our teams work across lines that often divide at other companies -- because we are more than just builders or innovators or visionaries or problem solvers... We are a team who through shared challenges, setbacks, and successes, has become more than the sum of our parts. \n\nWe are looking for people who want to work in a fast-paced, dynamic environment.  This is super challenging work that will develop your resources and skillset in ways that will set you up for a future in Product Management.  You will get as much opportunity as you are willing and able to take on.  If working with a lot of smart, passionate, and humble people is your thing then this may be the opportunity for you.  People who thrive here love to work in teams, share ideas, build on each other's skills and experiences and ship amazing stuff.   We also really value people who are creative and come at hard problems with tenacity.  \n\nSo if you’re talented, driven, creative, and hungry to bring something entirely new and wildly ambitious into the world (and have some fun doing it), then we want to talk! \n\nWhat you’ll do:\t \n\nOur internship program is designed to give you a taste of how our role shapes the product we deliver.  It is immersive.  You will get deep into how we move fast and deliver value to customers \n\nTeam up with data science, user experience, engineering, and our business teams - you will learn how to identify and test the best ideas that lead to growth.   \n\nOur interns learn the skills here that they can use anywhere.  You will sit in on customer calls and learn how we gather signal to use in developing ideas.   \n\nYou will also experience how we align our plans and communicate and collaborate with senior executives.  No two days are the same.   \n\nOwn and ship a meaningful project, end-to-end. We believe strongly in ownership at The Trade Desk, and we are committed to you having something substantial to show for your time here that will make a positive impact for the team \n\nReceive one-on-one mentorship from an experienced Product Manager \n\nCollaborate with a globally-connected team and other Interns  \n\nAre you looking for easy problems?  This isn’t the experience for you.  We are looking for people with the courage and grit to take on and tackle hard problems.  And we are there to help you and coach you along the way.  Like a challenge?  Want to learn a lot in a short period of time and have fun doing it?  This is for you.  \n\nWho you are: \n\nBackground in various combinations of software development, engineering, data science, UX \n\nPassion -- Your work matters. Your features matter. You care and give your all \n\nGrit -- Sometimes solutions take creative thinking and multiple iterations. You might try many different approaches to get to the right answer \n\nCollaborative -- The best PMs are not necessarily those with the best ideas, but those that bring out the best in others and ensure the right things get done \n\nSelfless -- Product Management is about making sure the best work gets done by the team and making sure they share in the credit \n\nEmpathy -- As a PM you are the voice of the customer and need to represent them from a position of deep understanding \n\nEntrepreneur – As a PM you need to get out there and convince others of your ideas  \n\nExcellent communication/presentation skills  \n\nThe ability to solve complex, technical problems with creative solutions while managing tradeoffs \n\nStrong interest in what computing can do -- a passion for technology and how to apply that to problems of massive scale   \n\nEnrolled in a Bachelor's or Master's degree program \n\nHave an expected graduation date between Fall 2026 and Summer 2027 \n\nYou can work in one of our physical office locations for the duration of your internship. Roles are available in Bellevue WA or New York NY office \n\nWhat you’re looking for: \n\nDo you want to work on a meaningful and impactful project that makes a difference? Are you eager to innovate? - to work on unsolved problems where you are responsible for the outcome. Do you have a passion for solving hard problems at scale? Are you looking to join a trust-based, globally-connected team, where your contributions will make a meaningful difference?    \n\nIf this sounds like you, we welcome your application and invite you to find out why Fortune named The Trade Desk to the Fortune Future 50 list and the list of 100 Fastest Growing Companies. \n\nOur Compensation and Benefits (for NY, CO, CA, and WA residents only)  \n\nAt the Trade Desk, Base Salary is one part of our competitive total compensation and benefits package and is determined using a salary range.  The hourly range for this role is \n$53/hr - $64/hr \nIn accordance with NY, CO, CA, and WA law, the range provided is The Trade Desk's reasonable estimate of the base compensation for this role.  The actual amount may differ based on non-discriminatory factors such as experience, knowledge, skills, abilities, and location.   \n\n \nThe Trade Desk also offers a competitive benefits package. Click here to learn more. \nNote: Interns are not eligible for variable incentive awards such as stock-based compensation, retirement plan, vacation, tuition reimbursement or parental leave. \n\n \nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records. \n\n \nThe Trade Desk does not accept unsolicited resumes from search firm recruiters. Fees will not be paid in the event a candidate submitted by a recruiter without an agreement in place is hired; such resumes will be deemed the sole property of The Trade Desk. The Trade Desk is an equal opportunity employer. All aspects of employment will be based on merit, competence, performance, and business needs. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law.",
          "value_type": "long_text"
        }
      ],
      "id": 5041449007,
      "updated_at": "2026-02-11T13:10:07-05:00",
      "requisition_id": null,
      "title": "2026 Product Management Intern",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-03T11:23:00-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4773967007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4446785007,
      "location": {
        "name": "Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4773967007,
      "updated_at": "2026-01-28T14:46:33-05:00",
      "requisition_id": "REQ-8103",
      "title": "Accounting Manager - Reporting",
      "company_name": "The Trade Desk",
      "first_published": "2025-06-25T16:49:20-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5007391007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4571207007,
      "location": {
        "name": "Singapore"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5007391007,
      "updated_at": "2026-02-05T21:03:35-05:00",
      "requisition_id": "REQ-8611",
      "title": "Account Manager",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-18T21:57:04-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4962243007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4546863007,
      "location": {
        "name": "Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Data Science",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4962243007,
      "updated_at": "2026-02-12T10:08:32-05:00",
      "requisition_id": "REQ-8459",
      "title": "Applied Scientist  II",
      "company_name": "The Trade Desk",
      "first_published": "2025-10-29T12:40:31-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4789299007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4454541007,
      "location": {
        "name": "San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Ventura OS",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4789299007,
      "updated_at": "2026-02-09T11:06:10-05:00",
      "requisition_id": "REQ-8152",
      "title": "Applied Scientist, Search and Recommender Systems- VenturaOS",
      "company_name": "The Trade Desk",
      "first_published": "2025-07-15T19:05:17-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4682475007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4400241007,
      "location": {
        "name": "Irvine; Los Angeles; New York; San Francisco; San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Legal",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4682475007,
      "updated_at": "2025-12-17T18:19:33-05:00",
      "requisition_id": "REQ-7770",
      "title": "Associate General Counsel, Commercial CTV & Advertising",
      "company_name": "The Trade Desk",
      "first_published": "2025-03-19T12:26:02-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5045847007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4589820007,
      "location": {
        "name": "Chicago"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Human Resources",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5045847007,
      "updated_at": "2026-02-06T19:08:18-05:00",
      "requisition_id": "REQ-8695",
      "title": "Benefits Operations Manager",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-06T19:08:18-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5046110007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4589820007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Human Resources",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5046110007,
      "updated_at": "2026-02-06T19:08:18-05:00",
      "requisition_id": "REQ-8695",
      "title": "Benefits Operations Manager",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-06T19:08:18-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5019357007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4576903007,
      "location": {
        "name": "Taipei City"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5019357007,
      "updated_at": "2026-01-09T05:22:47-05:00",
      "requisition_id": "REQ-8641",
      "title": "Business Development Director",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-09T05:21:24-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5041013007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4583385007,
      "location": {
        "name": "Seoul"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "Director, Business Development Korea\nWhat we do\nThe Trade Desk is transforming the way global brands and agencies reach audiences through\nthe open internet. In Korea—a strategically critical and fast-growing market in APAC—our\nBusiness Development team plays a central role in driving this transformation. As a Business\nDevelopment Director in Korea, you will help to lead our commercial efforts across key\ndomestic and outbound advertising brands as well as agency holding companies.\nYou’ll drive meaningful partnerships, elevate client relationships to a strategic level, and unlock\nscalable, long-term revenue opportunities for the business. This is a senior-level role requiring a\nproven track record in building trusted relationships, delivering commercial results, and\nfostering strong cross-functional collaboration across internal and external stakeholders.\nWe are proud of the culture we’ve built at The Trade Desk. We believe in curiosity, humility,\nand collaboration, and we value the unique experiences and perspectives that each person\nbrings. We are committed to creating an inclusive environment where everyone can do their\nbest work and be their authentic selves.\nIf you’re commercially driven, creative, and excited to be part of a dynamic, globally connected\nteam that’s reshaping the future of digital advertising in Korea and beyond—we want to talk.\nWhat you’ll do\naccounts.\n• Leads business development efforts for The Trade Desk’s largest or most strategic\n• Proactively builds and maintains relationships with top executives at brand advertisers\n(upstream stakeholders).\n• Acts as a master relationship builder, sales leader, and creative problem solver with\nstrong emotional intelligence and professionalism.\n• Serves as a consultative partner to clients and internal stakeholders alike.\n• Accurately manage and communicate monthly forecasts and pipeline.\n• Partners closely with GMs and VPs to define and execute strategic initiatives.\n• Leads collaboration with cross-functional teams to ensure effective client management.\n• Thinks beyond core sales responsibilities to understand and contribute to the business\nholistically.\n• Represents The Trade Desk at regional industry events and serves as a public-facing\nvoice for the company.\n• Understands and appropriately applies DOA (Delegation of Authority) in decision-\nmaking.\n• Identifies opportunities to improve operational efficiency and generate revenue;\nsponsors execution of key strategic projects.\n• Acts as a bridge between Business Development and senior TTD leadership, ensuring\nalignment and communication.\n• Participates in product feedback sessions and working groups when invited, sharing\nclient and market insights.\n• Takes personal ownership of company success and drives impact at a market level.\n• Evangelizes TTD’s values and vision to industry leaders; regularly presents at industry\nevents to shape market perception.\n• Contribute to The Trade Desk culture by bringing your full self.\nWho you are\n• Proven track record in business development and local/outbound sales within the\nKorean advertising ecosystem, with deep knowledge of the local media landscape,\nagency structures, and cultural nuances.\n• Leads strategic partnerships with top-tier Korean advertisers and agency holding groups.\n• Drives new business growth by identifying, pitching, and converting high-potential\naccounts across verticals.\n• Builds and nurtures long-term, consultative relationships with key decision-makers at\nboth brands and agencies.\n• Holds existing senior-level relationships with major advertisers and agencies in Korea.\n• Serves as a senior leader within the Korea BD team, mentoring and enabling junior and\nmid-level sellers to think and operate strategically.\n• Demonstrated success in sales leadership roles, consistently exceeding revenue targets\nand driving sustainable growth.\n• Skilled in building from the ground up—an agile, proactive self-starter who thrives in\nfast-changing and ambiguous environments.\n• Brings strong negotiation experience, including leading complex commercial deals with\nregional and global accounts.\n• Strong quantitative and analytical skills, with the ability to translate data into actionable\ncommercial strategies.\n• Comfortable engaging in technical product discussions, including roadmap prioritization\nand platform scoping.\n• Effective communicator with strong executive presence, able to confidently engage and\ninfluence C-level stakeholders.\n• Passionate about closing deals, owning the room, and driving measurable results.\n• Collaborates effectively with cross-functional teams, including product, marketing, client\nservices, finance, and legal.\n• Able to advocate for Korean market needs within global teams while aligning with\nbroader company strategy.\n• Active contributor to global initiatives, including multi-market client growth, product\nfeedback loops, and international expansion.\n• Bilingual fluency in Korean and English, enabling effective communication across global\nand local teams.",
          "value_type": "long_text"
        }
      ],
      "id": 5041013007,
      "updated_at": "2026-02-02T20:45:48-05:00",
      "requisition_id": null,
      "title": "Business Development Director ",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-02T20:45:48-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4832450007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4476411007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Business Intelligence",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4832450007,
      "updated_at": "2026-01-31T03:31:52-05:00",
      "requisition_id": "REQ-8274",
      "title": "Business Intelligence Analyst II",
      "company_name": "The Trade Desk",
      "first_published": "2025-10-03T13:37:06-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4918240007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4521563007,
      "location": {
        "name": "Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Business Intelligence",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4918240007,
      "updated_at": "2026-02-05T21:31:23-05:00",
      "requisition_id": "REQ-8354",
      "title": "Business Intelligence Analyst II",
      "company_name": "The Trade Desk",
      "first_published": "2025-09-24T17:12:23-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5033232007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4583664007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5033232007,
      "updated_at": "2026-01-23T15:59:13-05:00",
      "requisition_id": "REQ-8677",
      "title": "Business Strategy and Activation Director",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-23T15:59:13-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4710853007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "education": "education_required",
      "internal_job_id": 4413709007,
      "location": {
        "name": "Chicago; Detroit; Los Angeles; New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4710853007,
      "updated_at": "2025-10-29T19:36:31-04:00",
      "requisition_id": null,
      "title": "Client Service Associate (2026 Start)",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-28T11:46:22-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4950988007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4540180007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4950988007,
      "updated_at": "2026-01-28T15:01:48-05:00",
      "requisition_id": "REQ-8426",
      "title": "Commission Strategy & Analysis Associate Manager",
      "company_name": "The Trade Desk",
      "first_published": "2025-10-20T17:38:16-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5017839007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4576288007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Marketing",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5017839007,
      "updated_at": "2026-01-15T14:01:37-05:00",
      "requisition_id": "REQ-8635",
      "title": "Creative Director, EMEA",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-08T06:55:05-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5000919007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4568084007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Inventory & Data Partnerships",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5000919007,
      "updated_at": "2025-12-16T12:54:59-05:00",
      "requisition_id": "REQ-8571",
      "title": "Data Partnerships Director",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-16T12:54:59-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5028980007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4581646007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Inventory & Data Partnerships",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5028980007,
      "updated_at": "2026-02-11T14:37:02-05:00",
      "requisition_id": "REQ-8671",
      "title": "Data Partnerships Director, LATAM",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-21T09:05:39-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5027742007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4581088007,
      "location": {
        "name": "Chicago; Irvine; Los Angeles; New York; San Francisco; San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Legal",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5027742007,
      "updated_at": "2026-01-20T14:46:29-05:00",
      "requisition_id": "REQ-8669",
      "title": "Director, Associate General Counsel- Identity and Strategic Data Initiatives",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-17T12:33:03-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5042371007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4406450007,
      "location": {
        "name": "India"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "Job Title: Director, Business Development\nLocation:  1114 6th Avenue, New York, NY 10110\n*Telecommuting permitted: work may be performed within normal commuting distance from The Trade Desk, Inc. office in New York, NY\n \nJob Duties: Be the primary contact for customers and be in regular communication with customers to assess customer satisfaction and react to any issues. Compile industry trend data and campaign and spend data from various platforms to assemble client facing materials for the purpose of selling through products. Collect and analyze data related to customers target demographics and users, advising them on best practices of reaching intended audience. Use various platforms to analyze spend and marketing activity data to present back to customers to illustrate successful use of product. Help companies form their marketing strategy as it relates to digital and programmatic channels. Forecast all potential activity for customers and analyze various trends in marketing spend for those partners helping them to optimize activity. Responsible for being expertly aware of customers competitors, helping them to create unique marketing strategies. Closely monitor industry trends and trade literature to expertly speak to customers about state of the industry and guide them to adapt strategies. Attend tradeconferences to meet with customers and prospective customers educating them on company software. Develop and implement various procedures for company teams to service customers.\n \nSalary: $117,042 - $179,400/year\n \nJob Requirements: Bachelor’s degree (U.S. or foreign equivalent) in Marketing, Marketing Management or related field and eight (8) years of experience in the job offered or related role. Must have three (3) years of sales experience working for an online publisher, ad network, ad exchange, ad server, or senior agency. Must have three (3) years of experience meetingcompany revenue goals, including developing strong client relationships at media agencies, pitching capabilities and customizing ad tech products and services to meet their programmaticneeds, and using Salesforce to track and report revenue. Must have three (3) years of communication experience, including speaking with C-level clients to pitch ad tech products and services within a large media agency. Must have three (3) years of negotiation experience including building commercial endeavors and rate cards for a media agency client. Must haveone (1) year of experience creating relationships with decision-makers at enterprise client level,including having directly sold media or ad tech services to programmatic teams and Strategic Investments teams. Domestic travel required up to 10% of the time to visit client sites.\n\n#LI-DNI",
          "value_type": "long_text"
        }
      ],
      "id": 5042371007,
      "updated_at": "2026-02-05T21:02:53-05:00",
      "requisition_id": "REQ-7866",
      "title": "Director, Client Services",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-04T03:44:40-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4998465007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4566909007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Human Resources",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4998465007,
      "updated_at": "2025-12-05T13:53:36-05:00",
      "requisition_id": "REQ-8560",
      "title": "Director, Global HR Advisory Operations",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-05T13:49:59-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4872067007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4497534007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4872067007,
      "updated_at": "2026-01-28T15:01:46-05:00",
      "requisition_id": "REQ-8334",
      "title": "Director, Global Revenue Analytics",
      "company_name": "The Trade Desk",
      "first_published": "2025-09-11T16:38:41-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4764916007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4442280007,
      "location": {
        "name": "Bellevue; New York; Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Product Management",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4764916007,
      "updated_at": "2026-01-01T03:03:39-05:00",
      "requisition_id": "REQ-8076",
      "title": "Director, Product Management",
      "company_name": "The Trade Desk",
      "first_published": "2025-06-13T14:18:09-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4826385007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4473541007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4826385007,
      "updated_at": "2026-02-05T21:03:01-05:00",
      "requisition_id": "REQ-8238",
      "title": "Frond end Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-05T11:10:08-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5032586007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4583379007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5032586007,
      "updated_at": "2026-01-23T02:43:32-05:00",
      "requisition_id": null,
      "title": "Full Stack Engineer II - Front End Focused",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-23T02:43:32-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5043258007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4588694007,
      "location": {
        "name": "Bellevue; Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5043258007,
      "updated_at": "2026-02-04T21:08:06-05:00",
      "requisition_id": "REQ-8687",
      "title": "Full Stack Software Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-04T21:08:06-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5028027007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4581206007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Inventory & Data Partnerships",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5028027007,
      "updated_at": "2026-01-19T12:16:31-05:00",
      "requisition_id": "REQ-8670",
      "title": "General Manager, Inventory Management",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-19T09:52:51-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5011497007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4573249007,
      "location": {
        "name": "Chicago; New York; San Francisco"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5011497007,
      "updated_at": "2026-02-05T08:42:28-05:00",
      "requisition_id": "REQ-8620",
      "title": "General Manager, Revenue Operations (Growth)",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-07T18:29:54-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5011492007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4573248007,
      "location": {
        "name": "Chicago; New York; San Francisco"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5011492007,
      "updated_at": "2026-02-03T14:31:25-05:00",
      "requisition_id": "REQ-8619",
      "title": "General Manager, Revenue Operations (NAMER)",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-09T17:58:49-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5043847007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4588933007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5043847007,
      "updated_at": "2026-02-06T13:47:34-05:00",
      "requisition_id": null,
      "title": "Global Commercial Operations Leader",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-05T18:59:16-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5024451007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4579640007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "IT",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5024451007,
      "updated_at": "2026-01-14T16:00:28-05:00",
      "requisition_id": "REQ-8649",
      "title": "IT Network Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-14T16:00:28-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5043943007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4588968007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5043943007,
      "updated_at": "2026-02-06T07:46:30-05:00",
      "requisition_id": "REQ-8690",
      "title": "Lead Associate Account Director",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-06T07:33:54-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5001498007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4568358007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Business Intelligence",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5001498007,
      "updated_at": "2026-01-07T10:23:40-05:00",
      "requisition_id": null,
      "title": "Lead Staff Business Intelligence Analyst",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-09T21:17:29-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5044014007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4589003007,
      "location": {
        "name": "Irvine"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Business Intelligence",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5044014007,
      "updated_at": "2026-02-05T18:10:48-05:00",
      "requisition_id": "REQ-8691",
      "title": "Lead Staff Business Intelligence Analyst",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-05T18:10:48-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5032811007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4583475007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5032811007,
      "updated_at": "2026-01-28T06:50:29-05:00",
      "requisition_id": null,
      "title": "Lead Staff Software Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-28T06:50:29-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5024446007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4579639007,
      "location": {
        "name": "New York; Toronto"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5024446007,
      "updated_at": "2026-01-15T16:09:16-05:00",
      "requisition_id": "REQ-8647",
      "title": "Lead Staff Software Engineer, Front End - Deal Manager Experiences",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-14T16:26:42-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4988923007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4562625007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4988923007,
      "updated_at": "2025-11-25T18:12:28-05:00",
      "requisition_id": "REQ-8529",
      "title": "Lead Staff Software Engineer - Markets",
      "company_name": "The Trade Desk",
      "first_published": "2025-11-25T18:12:28-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4926299007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4526062007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4926299007,
      "updated_at": "2026-02-05T09:53:43-05:00",
      "requisition_id": null,
      "title": "Lead Systems Reliability Engineer (Linux & Distributed Systems)",
      "company_name": "The Trade Desk",
      "first_published": "2025-10-02T06:27:01-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5020009007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4577233007,
      "location": {
        "name": "Bellevue; Denver; San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Data Science",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5020009007,
      "updated_at": "2026-02-03T00:53:32-05:00",
      "requisition_id": "REQ-8643",
      "title": "Lead Staff Data Scientist, Inventory & Marketplace Quality ",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-12T08:26:05-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4997824007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4566640007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Inventory & Data Partnerships",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4997824007,
      "updated_at": "2026-01-19T12:16:26-05:00",
      "requisition_id": "REQ-8552",
      "title": "Manager, Inventory Management",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-05T16:40:50-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4875531007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4499297007,
      "location": {
        "name": "Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4875531007,
      "updated_at": "2026-01-28T14:46:43-05:00",
      "requisition_id": "REQ-8336",
      "title": "Manager, Payroll",
      "company_name": "The Trade Desk",
      "first_published": "2025-09-12T19:07:44-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5004617007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4569803007,
      "location": {
        "name": "Chicago; New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Operations",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5004617007,
      "updated_at": "2026-01-01T03:06:42-05:00",
      "requisition_id": "REQ-8602",
      "title": "Marketplace Quality Manager",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-15T13:43:21-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5000966007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4568110007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Marketing",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5000966007,
      "updated_at": "2025-12-09T11:35:43-05:00",
      "requisition_id": "REQ-8573",
      "title": "Performance Marketing Manager",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-09T11:34:52-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4996328007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4565890007,
      "location": {
        "name": "Bellevue; Denver; Irvine; Los Angeles; San Francisco; San Jose; Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Product Management",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4996328007,
      "updated_at": "2025-12-05T14:01:59-05:00",
      "requisition_id": "REQ-8547",
      "title": "Principal Product Manager,  Inventory & Real Time Bidding",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-02T15:58:56-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5039585007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4586900007,
      "location": {
        "name": "Singapore"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Real Estate/Workplace Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5039585007,
      "updated_at": "2026-02-05T21:03:45-05:00",
      "requisition_id": "REQ-8681",
      "title": "Receptionist",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-01T22:29:15-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5043970007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4588983007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Marketing",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5043970007,
      "updated_at": "2026-02-06T08:41:17-05:00",
      "requisition_id": null,
      "title": "Sales Strategy Director",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-06T08:41:17-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5020497007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4577489007,
      "location": {
        "name": "Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5020497007,
      "updated_at": "2026-01-28T14:46:50-05:00",
      "requisition_id": "REQ-8644",
      "title": "Senior Accountant",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-09T19:19:41-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5045180007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4589497007,
      "location": {
        "name": "Hamburg; Munich"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5045180007,
      "updated_at": "2026-02-06T10:54:10-05:00",
      "requisition_id": "REQ-8694",
      "title": "Senior Account Executive",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-06T08:28:40-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5051936007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4592493007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5051936007,
      "updated_at": "2026-02-12T22:53:50-05:00",
      "requisition_id": null,
      "title": "Senior Account Manager",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-12T22:51:42-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5003116007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4569087007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "IT",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5003116007,
      "updated_at": "2025-12-17T03:01:43-05:00",
      "requisition_id": "REQ-8598",
      "title": "Senior Analyst, Technology Governance & Risk",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-11T12:05:08-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5005399007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4570156007,
      "location": {
        "name": "Singapore"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Marketing",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5005399007,
      "updated_at": "2026-02-05T21:03:33-05:00",
      "requisition_id": "REQ-8605",
      "title": "Senior Brand Marketing Manager",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-16T04:54:06-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5007425007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4571225007,
      "location": {
        "name": "Hong Kong; Shanghai"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "What we do \n\nWe are looking for a strategic, entrepreneurial, and operationally excellent talent to join our fast-growing North Asia Outbound business. This is a unique hybrid role designed for a \"builder-practitioner\" who will directly drive business growth while simultaneously architecting the infrastructure required for long-term scalability. \n\nYour mission is to personally engage with outbound opportunities across North Asia—with a primary focus on Japan, Korea, Taiwan, and Hong Kong—to deeply understand the specific challenges brands face when expanding globally. You will then translate these frontline insights into a robust Centre of Excellence (CoE), equipping our commercial teams with the tools, processes, and innovative resources needed to accelerate growth without compromising on operational excellence. \n\nThe ideal candidate is a systems-thinker who isn't afraid to get their hands dirty in the sales process. You are motivated by enabling the success of others and possess the business acumen to influence senior stakeholders across a global organization. \n\n \n\nWhat you’ll do \n\nDrive Outbound Growth: Actively identify and execute on growth opportunities for brands expanding outbound from North Asia markets. \n\nFrontline Insight Gathering: Work directly on outbound opportunities to identify key operational bottlenecks, product gaps, and strategic challenges hindering market expansion. \n\nBuild the Infrastructure: Design and lead a Centre of Excellence (CoE) for North Asia Outbound, creating standardized playbooks and best practices based on your direct market experience. \n\nSecure Global Alignment: Partner with global stakeholders (Product, Engineering, Marketing, Legal) to advocate for the resources and product features necessary to support North Asia advertisers. \n\nEnable Commercial Success: Develop sales tools, training programs, and market intelligence reports to empower regional teams to perform more effectively. \n\nEstablish Strategic Relationships: Foster relationships with key brands and partners in the digital advertising ecosystem to shape how the market perceives our outbound capabilities. \n\nMeasure & Optimize: Establish KPIs for both the CoE and outbound sales performance, using data to iterate on strategies and maximize impact. \n\n \n\nWho you are \n\nExperienced Professional: 6+ years of experience in business development, operational roles, or program management within online advertising or marketing technology. \n\nRegional Expert: Deep understanding of the North Asia digital advertising landscape, with a specific focus on the ecosystem supporting brands in the region. \n\nBuilder & Scaler: Proven experience in building programs or centers of excellence, preferably in a commercial or sales enablement context. \n\nStrategic Seller: Ability to navigate complex sales environments and engage with senior stakeholders to drive market development strategies. \n\nProblem Solver: Exceptional ability to deconstruct complex problems and land scalable solutions through innovation and technology. \n\nInfluential Leader: Strong stakeholder management skills; able to secure buy-in from cross-functional teams across different time zones without direct authority. \n\nAdaptable & Proactive: A self-starter who thrives in ambiguity and can pivot between high-level strategy and hands-on execution. \n\nLinguistic Skills: Fluency in English is required; proficiency in Korean, or Chinese, or Japanese is a significant advantage.",
          "value_type": "long_text"
        }
      ],
      "id": 5007425007,
      "updated_at": "2026-02-04T05:05:54-05:00",
      "requisition_id": null,
      "title": "Senior Business Development Manager, North Asia Outbound (Operational Excellence) ",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-18T04:02:37-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5035778007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4584908007,
      "location": {
        "name": "Shanghai"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5035778007,
      "updated_at": "2026-01-27T19:07:58-05:00",
      "requisition_id": null,
      "title": "Senior Commercial Finance Analyst",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-27T19:07:58-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4844710007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4482698007,
      "location": {
        "name": "Chicago; Los Angeles; New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4844710007,
      "updated_at": "2026-01-28T14:46:38-05:00",
      "requisition_id": "REQ-8303",
      "title": "Senior Corporate Development Manager",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-29T11:36:58-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5000637007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4567934007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5000637007,
      "updated_at": "2026-02-02T21:11:01-05:00",
      "requisition_id": "REQ-8570",
      "title": "Senior Database Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-09T22:10:15-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5000638007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4567934007,
      "location": {
        "name": "Hong Kong"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5000638007,
      "updated_at": "2026-02-02T21:11:53-05:00",
      "requisition_id": "REQ-8570",
      "title": "Senior Database Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-02T21:11:53-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5019257007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4576863007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5019257007,
      "updated_at": "2026-02-02T21:13:02-05:00",
      "requisition_id": "REQ-8639",
      "title": "Senior Database Engineer - DBA",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-08T23:53:29-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5041111007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4587632007,
      "location": {
        "name": "Tokyo"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Inventory & Data Partnerships",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5041111007,
      "updated_at": "2026-02-04T23:02:57-05:00",
      "requisition_id": null,
      "title": "Senior Data Partnerships Manager",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-04T23:02:57-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4689386007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4403422007,
      "location": {
        "name": "Singapore"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Data Science",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4689386007,
      "updated_at": "2025-11-17T03:02:14-05:00",
      "requisition_id": "REQ-7814",
      "title": "Senior Data Scientist",
      "company_name": "The Trade Desk",
      "first_published": "2025-03-26T21:04:57-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5021488007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4578164007,
      "location": {
        "name": "Bellevue; San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Data Science",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5021488007,
      "updated_at": "2026-02-02T22:35:07-05:00",
      "requisition_id": "REQ-8645",
      "title": "Senior Data Scientist, Channel Growth",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-12T10:46:07-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4828370007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4474451007,
      "location": {
        "name": "Toronto"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Data Science",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4828370007,
      "updated_at": "2025-11-10T16:50:22-05:00",
      "requisition_id": "REQ-8191",
      "title": " Senior Data Scientist-Measurement ",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-14T11:01:56-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4828316007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4474451007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Data Science",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4828316007,
      "updated_at": "2025-11-10T16:50:22-05:00",
      "requisition_id": "REQ-8191",
      "title": "Senior Data Scientist-Measurement ",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-14T11:01:55-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4666557007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4392694007,
      "location": {
        "name": "Hamburg; Munich"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4666557007,
      "updated_at": "2026-02-05T21:02:50-05:00",
      "requisition_id": "REQ-7653",
      "title": "Senior Director, Business Development, Agency",
      "company_name": "The Trade Desk",
      "first_published": "2025-04-08T12:50:04-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4919228007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4522128007,
      "location": {
        "name": "Chicago; Los Angeles; San Francisco"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4919228007,
      "updated_at": "2026-01-28T14:46:45-05:00",
      "requisition_id": "REQ-8359",
      "title": "Senior Director, Corporate Development",
      "company_name": "The Trade Desk",
      "first_published": "2025-09-25T12:58:58-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4790338007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4455104007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4790338007,
      "updated_at": "2026-01-28T15:01:44-05:00",
      "requisition_id": "REQ-8154",
      "title": "Senior Finance Manager, Sales Finance & Strategy",
      "company_name": "The Trade Desk",
      "first_published": "2025-07-16T14:31:46-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5041276007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4587707007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5041276007,
      "updated_at": "2026-02-03T10:31:30-05:00",
      "requisition_id": null,
      "title": "Senior Front-End Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-03T10:31:30-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5011605007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4573311007,
      "location": {
        "name": "Bellevue"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "About the Role \n\nAs a Senior Manager, Software Engineering at The Trade Desk, you will lead globally distributed engineering teams building and operating large-scale, highly available systems. You will set direction, establish strong operating mechanisms, and maintain a high bar for engineering excellence, balancing execution speed with reliability, quality, and long-term maintainability. You’ll work closely with cross-functional partners to deliver meaningful business outcomes while growing leaders and strengthening team culture. \n\nWhat we do: \n\nWe trust our engineering managers to grow, empower, and support our greatest asset, our people. At The Trade Desk, every opportunity to engage internal and external stakeholders is unique. \n\nIn this role, you will manage teams responsible for developing custom solutions and strategic integrations for our major clients. You will partner across Engineering, Product, Business Development, and Technical Account Management to incorporate stakeholder needs and drive strategic outcomes. Your teams will shape their charter in alignment with the business pipeline, supporting some of our largest and most impactful client opportunities. \n\nOur system performs every day, 24/7, serving global traffic. It’s important that we focus on quality at scale in an agile environment based on collaboration, ownership, and trust. Our engineering managers are there to build trust with our talented engineers, understand their strengths and weaknesses, and ensure they are motivated and productive, while having fun and enjoying every day. \n\nWhat you will do: \n\nOwn end-to-end delivery of complex initiatives with ambiguous requirements, align stakeholders, and drive execution to measurable outcomes. \n\nLead and develop multiple teams across regions (including people leaders and senior technical leaders), build a culture of high standards, ownership, and continuous improvement. \n\nDefine and execute the technical vision and strategy for your area, balance near-term delivery with reusable foundations and long-term platform leverage. \n\nMake portfolio-level decisions on what to build, what to standardize, and what to decline, ensure capacity is aligned to the highest-impact work. \n\nDrive architectural direction and quality at scale through reference architectures, integration patterns, data contracts, and appropriate security/privacy guardrails. \n\nEstablish clear operating mechanisms for intake and prioritization, delivery governance, escalation paths, postmortems, and support models for production systems. \n\nPartner effectively across Product, Solution Consulting, Technical Account Management, Business Development, Data Science, and platform engineering to align roadmaps, manage expectations, and resolve escalations. \n\nDefine success metrics and instrumentation to measure quality and business impact (e.g., adoption/usage, reliability, support load, and stakeholder outcomes). \n\nOwn resource planning across regions, hiring strategy, org design, performance management, and succession planning to build a durable leadership bench. \n\nStay close to architecture and delivery to guide tradeoffs, remove blockers, and ensure high-quality outcomes. \n\nWHO YOU ARE:  \n\n13+ years of software development experience, including building and maintaining production systems. \n\n5+ years of experience managing managers and/or leading multiple teams through senior technical leaders. \n\nBachelor’s/Master’s degree in Computer Science or a related engineering field (or equivalent experience). \n\nStrong technical background in distributed systems, API design, and cloud infrastructure, able to guide architecture and tradeoffs at scale. \n\nProven ability to run complex, cross-functional programs with high ambiguity, competing priorities, and external stakeholders. \n\nExcellent executive communication and stakeholder management, able to align teams and drive decisions with clarity and credibility. \n\n Deep understanding of modern software development practices (engineering excellence, operational rigor, delivery mechanisms). \n\nExperience operating in an Agile environment across multiple concurrent initiatives and geographically distributed teams. \n\nAd-tech domain experience is a plus.",
          "value_type": "long_text"
        }
      ],
      "id": 5011605007,
      "updated_at": "2026-01-01T03:06:45-05:00",
      "requisition_id": "REQ-8604",
      "title": "Senior Manager, Software Engineering - Custom Solutions",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-23T15:54:16-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4833571007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4476974007,
      "location": {
        "name": "Bellevue; Irvine; Los Angeles; San Francisco; San Jose; Seattle; Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Product Management",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4833571007,
      "updated_at": "2026-01-01T03:04:13-05:00",
      "requisition_id": "REQ-8280",
      "title": "Senior Product Manager, Infra Generalist",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-19T18:24:43-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4952933007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4541313007,
      "location": {
        "name": "Seoul"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "Senior Account Executive, Business Development – Korea   \n\n \n\nWhat We Do \n\nAt The Trade Desk, the Business Development team fuels our growth by helping advertisers and agencies embrace the open internet. \n\nWe partner with the most ambitious brands and agencies across Korea and the wider North Asia region to unlock the full potential of programmatic—across CTV, video, display, native, and beyond. \n\nWe’re now expanding our outbound and omnichannel partnerships, connecting Korea’s leading advertisers with global audiences through data-driven, transparent advertising. \n\n \n\nAbout the Role \n\nAre you a proactive, strategic seller who can turn curiosity into consultative partnerships? \n\nDo you combine commercial acumen with a love for learning new technology? \n\nDo you thrive in fast-changing environments and value integrity, empathy, and teamwork? \n\nIf so, we’re looking for a Senior Account Executive who can be both a trusted consultant and driven deal-maker — balancing relationship building with data-backed, insight-led selling. \n\n \n\nWhat You’ll Do \n\nDrive New Growth: Identify, prospect, and onboard new advertiser and agency partners across outbound and domestic opportunities (e.g., gaming, entertainment, commerce, tech). \n\nStrategic Selling: Translate client objectives into platform-based solutions, connecting brand and performance goals with The Trade Desk’s unique value proposition. \n\nConsultative Partnership: Lead with insights — conduct discovery sessions, present omnichannel strategies, and educate partners on the evolving media landscape (CTV, identity, data-driven buying). \n\nCollaborate for Scale: Work closely with Client Services, Marketing, and Global teams to activate, optimize, and grow accounts through structured joint business plans. \n\nPipeline Discipline: Build and manage accurate forecasts and opportunity pipelines, ensuring consistency and accountability in Salesforce. \n\nMarket Intelligence: Stay ahead of market, competitor, and industry trends to inform strategic recommendations and thought leadership. \n\nCultural Leadership: Embody The Trade Desk values — bring curiosity, objectivity, and collaboration to everything you do. \n\n \n\n \n\nWho You Are \n\n5-8 years of experience in digital media, advertising, or ad-tech, ideally in programmatic, DSP, or data-driven sales. \n\nProven experience developing new business opportunities and growing key accounts. \n\nStrong understanding of the Korean media ecosystem, with exposure to outbound or cross-border campaigns a plus. \n\nExcellent communicator — able to simplify complex tech into clear, client-relevant narratives. \n\nAnalytical and structured — confident interpreting data, building forecasts, and crafting ROI-based recommendations. \n\nProactive and strategic — comfortable leading conversations, identifying opportunities, and setting long-term plans. \n\nEmpathetic collaborator who values shared success across cross functional teams. \n\nFluent in Korean and English. \n\n \n\n \n\nWhy Join Us \n\nYou’ll be part of a high-impact regional team shaping how Korean advertisers engage the world. \n\nWe offer an environment where curiosity is celebrated, integrity is non-negotiable, and innovation is constant. \n\nAt The Trade Desk, you’ll grow not only your career but also the industry itself.",
          "value_type": "long_text"
        }
      ],
      "id": 4952933007,
      "updated_at": "2026-02-12T10:01:47-05:00",
      "requisition_id": "REQ-8438",
      "title": "Senior Sales Manager ",
      "company_name": "The Trade Desk",
      "first_published": "2025-10-23T05:53:43-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4614603007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4367928007,
      "location": {
        "name": "Bellevue; Boulder; Denver; New York; Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4614603007,
      "updated_at": "2025-11-12T12:29:19-05:00",
      "requisition_id": "REQ-7481",
      "title": "Senior Site Reliability Engineer - Infrastructure",
      "company_name": "The Trade Desk",
      "first_published": "2025-03-06T20:22:43-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4826602007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4473613007,
      "location": {
        "name": "Shanghai"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "The Trade Desk is a global technology company with a mission to create a better, more open Internet for everyone through principled, intelligent advertising.\nHandling over 1 Trillion queries per day, our team works with some of the most exciting stacks to keep up with our unprecedented scale. Whether it’s spark clusters, databricks, machine learning, or anything else, we choose the right technology to handle our difficult problems. Our team works together to solve these and other difficult problems. We are constantly learning, building, and working together.\nDo you have a passion for solving hard problems at scale? Are you eager to join a team of like-minded, talented, passionate engineers who are as excited by our challenges as you are? \nABOUT THE ROLE:\nOur Senior Software Engineers take end-to-end ownership of designing, building, and delivering data products for our clients. You will actively participate in all aspects of this process.\nYou will tackle petabyte-scale data challenges, large-scale distributed systems coordinating thousands of servers in both cloud and physical data centers worldwide, as well as machine learning and advanced technologies, to name just a few.\nYou will work on a variety of tasks, including data processing pipelines, data processing automation, model training pipelines, and model serving.\nYou will collaborate closely with data scientists and business teams to bring exceptional solutions to our customers.\nWHO WE ARE LOOKING FOR:\nYou have a sustained track record of making significant, self-directed, and end-to-end contributions to large and impactful data engineering projects. You think beyond just the task at hand to deeply understand the 'why' behind what you are doing.\nYou understand engineering fundamentals and are a creative thinker. At our scale, many off-the-shelf techniques and existing technologies (open source and enterprise) simply don't work. You are able to work from first principles to evaluate solutions and adapt them to a unique environment. You are not bound by \"the way things have always been done\". We don't need engineers who know all the answers; we need engineers who can invent the answers no one has thought of yet, to the questions yet to be asked.\nYou have experience in data engineering. You've developed with a variety of platforms and technologies, such as Spark, .NET Core, Java, Scala, SQL Server, Docker, Kubernetes, AWS, Azure, etc..\nYou have a product-focused mindset. You have the passion and ability to contribute to the process of discovering what will delight our clients and push forward one of the world's largest and most influential industries toward a vision of openness, transparency, and evidence-based decision-making.\nYou work with confidence and without ego. Our engineers have deep knowledge and exercise a high degree of leadership in their daily work. You have strongly-held, defensible ideas, and advocate for what you believe is right. You are also adept at identifying and evaluating trade-offs, willing to be proven wrong, and quick to walk through fire to support your fellow teammates.",
          "value_type": "long_text"
        }
      ],
      "id": 4826602007,
      "updated_at": "2026-01-01T03:07:08-05:00",
      "requisition_id": "REQ-8258",
      "title": "Senior Software Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2025-11-13T01:43:42-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4977767007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4556402007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4977767007,
      "updated_at": "2025-11-13T22:08:05-05:00",
      "requisition_id": "REQ-8480",
      "title": "Senior Software Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2025-11-13T22:08:05-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4834108007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4477239007,
      "location": {
        "name": "Bellevue; Denver; San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4834108007,
      "updated_at": "2025-11-10T16:48:24-05:00",
      "requisition_id": "REQ-8287",
      "title": "Senior Software Engineer - Data Transparency",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-20T13:43:35-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4689448007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4403442007,
      "location": {
        "name": "Bellevue"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4689448007,
      "updated_at": "2025-11-17T03:02:17-05:00",
      "requisition_id": "REQ-7823",
      "title": "Senior Software Engineer - Geo Targeting",
      "company_name": "The Trade Desk",
      "first_published": "2025-09-10T19:41:30-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5003632007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4569302007,
      "location": {
        "name": "San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5003632007,
      "updated_at": "2025-12-17T15:52:00-05:00",
      "requisition_id": "REQ-8600",
      "title": "Senior Software Engineer - OpenPath",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-16T22:46:32-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5015698007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4575263007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5015698007,
      "updated_at": "2026-01-13T10:32:01-05:00",
      "requisition_id": "REQ-8631",
      "title": "Senior Vice President, Business Development, Agency",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-06T12:51:53-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5015623007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4575231007,
      "location": {
        "name": "Chicago; New York; San Francisco; San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5015623007,
      "updated_at": "2026-02-04T23:46:30-05:00",
      "requisition_id": "REQ-8625",
      "title": "Senior Vice President, Marketing Science",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-07T09:57:58-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5015654007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4575246007,
      "location": {
        "name": "San Francisco"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5015654007,
      "updated_at": "2026-01-13T10:31:53-05:00",
      "requisition_id": "REQ-8627",
      "title": "Senior Vice President, Strategic Partnerships",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-06T19:11:24-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5026273007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4580478007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5026273007,
      "updated_at": "2026-02-05T21:03:38-05:00",
      "requisition_id": "REQ-8659",
      "title": "Site Reliability Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-16T05:56:55-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4972481007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4553316007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4972481007,
      "updated_at": "2025-11-12T20:25:59-05:00",
      "requisition_id": "REQ-8486",
      "title": "Software Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2025-11-11T22:48:05-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5021705007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4578270007,
      "location": {
        "name": "San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "Job Title: Software Engineer II \nLocation: 50 West San Fernando Street, Suite 1800, San Jose, CA 95113 \n\n*Telecommuting permitted: work may be performed within normal commuting distance from The Trade Desk, Inc. office in San Jose, CA. \n\nJob Duties: Design, build, deliver, and own full lifecycle development software from inception to production by interfacing with multiple stakeholders (product, engineering leaders and UX designers), understanding requirements and mocks, and executing on them using a variety of tools and technologies (including server-side technologies such as .NET and SQL, as well as client-side technologies such as JavaScript, ReactJS, HTML and CSS). Drive complex software changes involving multiple components and deliver quality changes, including writing automated tests. Work as part of a team to contribute to feature development, collaborating with other engineers and learning from peers to help deliver work timely and support overall project goals. Iterate on and maintain existing product features including identifying and fixing bugs and writing automated tests to prevent such situations in the future ensuring an improved experience and higher quality product. Validate changes to ensure high quality product releases. Use existing testing methodologies (both manual and automated) to validate work as well as evaluate the testing strategies of others. Work in a distributed system environment. Understand system architecture fundamentals through self-directed learning. \n\nSalary: $151,400 - $227,000 / year \n\nJob Requirements: Bachelor's degree (U.S. or foreign equivalent) in Computer Science or related field and two (2) years of experience in the job offered or related role. Must have two (2) years of experience with: JavaScript, TypeScript and CSS, including client-side libraries and frameworks; one or more of the following languages on the server-side: C#, Java, or similar; and software development code editors and version control systems. Must have one (1) year experience with: Agile Scrum tools; and interacting with UX design system software to build complex workflow from mocks provided.",
          "value_type": "long_text"
        }
      ],
      "id": 5021705007,
      "updated_at": "2026-01-12T11:19:57-05:00",
      "requisition_id": null,
      "title": "Software Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-12T11:19:57-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4826493007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4473577007,
      "location": {
        "name": "Singapore"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4826493007,
      "updated_at": "2026-02-11T21:16:31-05:00",
      "requisition_id": "REQ-8246",
      "title": "Software Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-20T02:48:36-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5032903007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4583517007,
      "location": {
        "name": "Bellevue"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "Job Title: Software Engineer II \nLocation: 50 West San Fernando Street, Suite 1800, San Jose, CA 95113 \n\n*Telecommuting permitted: work may be performed within normal commuting distance from The Trade Desk, Inc. office in San Jose, CA. \n\nJob Duties: Design, build, deliver, and own full lifecycle development software from inception to production by interfacing with multiple stakeholders (product, engineering leaders and UX designers), understanding requirements and mocks, and executing on them using a variety of tools and technologies (including server-side technologies such as .NET and SQL, as well as client-side technologies such as JavaScript, ReactJS, HTML and CSS). Drive complex software changes involving multiple components and deliver quality changes, including writing automated tests. Work as part of a team to contribute to feature development, collaborating with other engineers and learning from peers to help deliver work timely and support overall project goals. Iterate on and maintain existing product features including identifying and fixing bugs and writing automated tests to prevent such situations in the future ensuring an improved experience and higher quality product. Validate changes to ensure high quality product releases. Use existing testing methodologies (both manual and automated) to validate work as well as evaluate the testing strategies of others. Work in a distributed system environment. Understand system architecture fundamentals through self-directed learning. \n\nSalary: $151,400 - $227,000 / year \n\nJob Requirements: Bachelor's degree (U.S. or foreign equivalent) in Computer Science or related field and two (2) years of experience in the job offered or related role. Must have two (2) years of experience with: JavaScript, TypeScript and CSS, including client-side libraries and frameworks; one or more of the following languages on the server-side: C#, Java, or similar; and software development code editors and version control systems. Must have one (1) year experience with: Agile Scrum tools; and interacting with UX design system software to build complex workflow from mocks provided.",
          "value_type": "long_text"
        }
      ],
      "id": 5032903007,
      "updated_at": "2026-01-23T12:41:15-05:00",
      "requisition_id": null,
      "title": "Software Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-23T12:41:15-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5051919007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4592482007,
      "location": {
        "name": "Bangalore"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5051919007,
      "updated_at": "2026-02-12T20:42:40-05:00",
      "requisition_id": "REQ-8710",
      "title": "Software Engineer II",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-12T20:42:40-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4985094007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4560508007,
      "location": {
        "name": "Bellevue; Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4985094007,
      "updated_at": "2025-12-15T18:15:59-05:00",
      "requisition_id": "REQ-8516",
      "title": "Software Engineer II - Data Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2025-11-19T16:31:31-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4690683007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4404003007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4690683007,
      "updated_at": "2026-02-11T21:16:28-05:00",
      "requisition_id": "REQ-7837",
      "title": "Software Engineer II - Identity",
      "company_name": "The Trade Desk",
      "first_published": "2025-03-27T03:35:06-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5043167007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4588648007,
      "location": {
        "name": "Bellevue; Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5043167007,
      "updated_at": "2026-02-09T17:28:27-05:00",
      "requisition_id": "REQ-8686",
      "title": "Software Engineer II - Platform API",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-09T17:28:27-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4823184007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4472083007,
      "location": {
        "name": "Boulder"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4823184007,
      "updated_at": "2026-01-13T16:12:12-05:00",
      "requisition_id": "REQ-8201",
      "title": "Software Engineer II - Price Optimization & Bidding",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-12T18:30:48-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4995415007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": null,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4995415007,
      "updated_at": "2025-12-02T10:59:34-05:00",
      "requisition_id": null,
      "title": "Sourcing at TTD ",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-02T07:51:32-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5032686007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4583431007,
      "location": {
        "name": "Hamburg"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5032686007,
      "updated_at": "2026-02-05T21:03:43-05:00",
      "requisition_id": "REQ-8675",
      "title": "Sr Account Manager",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-23T10:08:57-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5013297007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4574144007,
      "location": {
        "name": "Shanghai"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5013297007,
      "updated_at": "2026-02-03T12:46:31-05:00",
      "requisition_id": "REQ-8623",
      "title": "Sr Account Manager",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-30T21:07:12-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5048990007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4591132007,
      "location": {
        "name": "Irvine; Los Angeles; New York; San Francisco; San Jose; Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5048990007,
      "updated_at": "2026-02-10T15:43:31-05:00",
      "requisition_id": "REQ-8704",
      "title": "Sr Anaplan Analyst",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-10T15:40:13-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5039323007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4586761007,
      "location": {
        "name": "Shanghai"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "The Trade Desk is changing the way global brands and their agencies advertise to audiences around the world. How? With a media buying platform that helps brands deliver a more insightful and relevant ad experience for consumers –– and sets a new standard for global reach, accuracy, and transparency. We are proud of the culture we have built. We value the unique experiences and perspectives that each person brings to The Trade Desk, and we are committed to fostering inclusive spaces where everyone can bring their authentic selves to work every day. \n\nSo, if you are talented, driven, creative, and eager to join a dynamic, globally-connected team, then we want to talk!\n\nThe Trade Desk’s Global Commercial Finance team plays a crucial role in supporting our business development teams by structuring and pricing deals to ensure they align with our internal policies and strategic goals. We are seeking a Senior Analyst to support our APAC Commercial Finance function, based out of our Shanghai office. While focused on the APAC region you will be part of a global team, with the opportunity to be involved in aspects of the global function. There will be a focus on offering guidance to consistently drive deal execution, managing risk while complying with company policy and procedures, advising on deal revenue recognition, and with the added benefit of shaping future growth. This role reports directly into the APAC Controller with a dotted reporting line into the Commercial Finance Manager, based in the U.S.\n\n\nWHAT YOU'LL DO:\n•\tResponsible for managing the deal lifecycle, from initial structuring to post-execution support.\n•\tPartner with the APAC region Sales team to structure and gain internal approval of deals, with a focus on ensuring that deals are in line with organizational strategy.  \n•\tPartner and collaborate with other internal stakeholders including the Legal, Revenue Operations, Revenue Accounting and FP&A teams, while ensuring compliance with internal policies and procedures. \n•\tResponsible for generating margin calculators to assess the financial strength of deals. \n•\tAssist the APAC region Sales team with concession requests and regional initiatives. \n•\tPerform post execution support of deals such as acting as support to resolve issues between the Sales team, Revenue Accounting and Order Management teams.  \n•\tWork across regional and global teams to improve current processes and procedures, continuously considering ways we can improve our workflow to increase efficiency and/or accuracy. \n\n\nWHO YOU ARE:\n•\tQualified accountant (CPA/ACCA or similar), MBA, or 5+ year of practical experience in a comparable technical field \n•\tRevenue Accounting experience is preferred\n•\tExperience working for a scaled US-listed technology company is preferred.\n•\tExperience in structuring and pricing deals and/or working around sales-focused financial models in MS Excel\n•\tExcellent communication skills with an ability to communicate complex topics and modeling to a variety of stakeholders and company leadership \n•\tA proactive and strategic thinker who can manage multiple priorities and deadlines while working with a diverse cross-functional team \n•\tStrong interpersonal skills and the capacity to build positive working relationships across functions and at every level in the organization.\n•\tStrong analytical and problem-solving skills with ability to work under pressure and handle problems with confidence and maturity. \n•\tStrong attention to detail, with focus on accuracy, compliance and delivering high-quality work. \n•\tAble to be available during early and late business hours to accommodate global time zones, able to travel as required.",
          "value_type": "long_text"
        }
      ],
      "id": 5039323007,
      "updated_at": "2026-02-09T23:46:31-05:00",
      "requisition_id": "REQ-8680",
      "title": "Sr Commercial Finance Analyst",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-07T04:04:26-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4995492007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4565568007,
      "location": {
        "name": "Hamburg"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4995492007,
      "updated_at": "2026-01-05T11:30:46-05:00",
      "requisition_id": null,
      "title": "Sr Director, Business Development - Advertiser (FMCG / Auto)",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-02T09:55:07-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5041035007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4587590007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5041035007,
      "updated_at": "2026-02-05T21:03:51-05:00",
      "requisition_id": "REQ-8683",
      "title": "Sr Director, Commercial Operations",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-03T00:31:18-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5039610007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4586911007,
      "location": {
        "name": "Singapore"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Marketing",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5039610007,
      "updated_at": "2026-02-05T21:03:48-05:00",
      "requisition_id": "REQ-8682",
      "title": "Sr Director, Marketing",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-02T00:40:01-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5044031007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4589005007,
      "location": {
        "name": "Bellevue; New York; San Francisco; Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Operations",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5044031007,
      "updated_at": "2026-02-05T20:48:14-05:00",
      "requisition_id": "REQ-8692",
      "title": "Sr Enterprise Engineer - Salesforce",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-05T20:48:14-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4985784007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4560893007,
      "location": {
        "name": "New York; Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "IT",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4985784007,
      "updated_at": "2025-11-20T20:01:40-05:00",
      "requisition_id": "REQ-8522",
      "title": "Sr Incident Response Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2025-11-19T20:11:29-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4779743007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4449596007,
      "location": {
        "name": "San Francisco"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4779743007,
      "updated_at": "2026-01-06T19:25:35-05:00",
      "requisition_id": "REQ-8118",
      "title": "Sr Software Engineer - AI",
      "company_name": "The Trade Desk",
      "first_published": "2025-07-02T20:27:26-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5016313007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4449596007,
      "location": {
        "name": "San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5016313007,
      "updated_at": "2026-01-06T19:25:37-05:00",
      "requisition_id": "REQ-8118",
      "title": "Sr Software Engineer - AI",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-06T19:25:37-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5016314007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4449596007,
      "location": {
        "name": "Bellevue; Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5016314007,
      "updated_at": "2026-01-06T19:25:39-05:00",
      "requisition_id": "REQ-8118",
      "title": "Sr Software Engineer - AI",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-06T19:25:39-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4984984007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4560457007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4984984007,
      "updated_at": "2026-01-27T10:16:49-05:00",
      "requisition_id": "REQ-8515",
      "title": "Sr Trading Specialist",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-05T10:55:37-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5049775007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4591536007,
      "location": {
        "name": "San Jose"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Ventura OS",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5049775007,
      "updated_at": "2026-02-12T12:01:38-05:00",
      "requisition_id": "REQ-8706",
      "title": "Staff Android Platform Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-12T12:01:38-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5038668007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4586471007,
      "location": {
        "name": "United States"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Data Science",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "Job Title: Staff Data Scientist\nLocation: 100% remote\n\n*Telecommuting role to be performed anywhere in the U.S.\n\nJob Duties: Design and develop systems to organize and streamline the use of data in the organization. Identify relationships and trends in data, as well as any factors that could affect research results. Analyze and interpret statistical data to identify significant differences in relationships among sources of information. Adapt statistical methods to solve specific problems in many fields, such as economics, biology, and engineering. Develop software applications or programming to use for statistical modeling and graphic analysis. Develop and test experimental designs, sampling techniques, and analytical methods. Prepare data for processing by organizing information, checking for inaccuracies, and adjusting and weighing raw data. Process large amounts of data for statistical modeling and graphic analysis, using computers. Determine whether statistical methods are appropriate, based on user needs or research questions of interest. Report results of statistical analyses, including information in the form of graphs, charts, and tables. Design research projects that apply valid scientific techniques and use information obtained from baselines or historical data to structure uncompromised and efficient analyses. Evaluate sources of information to determine any limitations, in terms of reliability or usability. Examine theories, such as those of probability and inference, to discover mathematical bases for new or improved methods of obtaining and evaluating numerical data. Present statistical and nonstatistical results, using charts, bullets, and graphs, in meetings or conferences to audiences such as clients, peers, and students.\n\nSalary: $243,800 - $365,600 /year\n\nJob Requirements: Bachelor's degree (U.S. or foreign equivalent) in Computer Science, Statistics, Biochemistry or related field and ten (10) years of experience in the job offered or related role OR Doctorate degree (U.S. or foreign equivalent) in Computer Science, Statistics, Biochemistry or related field and five (5) years of experience in the job offered or related role. Must have five (5) years of experience with: high performance computing, such as running data pipelines and/or numerical optimization on on-prem or cloud-based distributed systems; Python; and scientific programming, including code-based data analysis and optimization leveraging tools like Spark, pandas, numpy, and Mathematica. Must have three (3) years of experience with SQL and multiple databases. Must have three (3) years of databricks infrastructure management experience. Must have three (3) years of cloud data management experience, including cost accounting. Must have two (2) years of end-to-end experience building machine learning pipelines.",
          "value_type": "long_text"
        }
      ],
      "id": 5038668007,
      "updated_at": "2026-01-30T11:55:37-05:00",
      "requisition_id": null,
      "title": "Staff Data Scientist",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-30T11:53:36-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5046949007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4590262007,
      "location": {
        "name": "Bellevue"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Product Management",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "WHO WE ARE LOOKING FOR \n\nTHIS ROLE IS AT THE INTERSECTION OF AI AND REVENUE OPERATIONS: This is a strategic Product Management role where you’ll embed AI capabilities into the commercial workflows that power The Trade Desk’s global go-to-market engine. You’ll work at the intersection of large language models, agentic AI workflows, and enterprise sales operations — surfacing intelligent insights and optimizing workflows that help our commercial teams work faster, forecast with confidence, and focus on what matters most: winning and growing client relationships. \n\n \n\nOur Business Technology team owns the commercial operations ecosystem at The Trade Desk — the internal systems, platforms, and workflows that enable our revenue organization to operate at scale. We serve Business Development, Client Services, Revenue Operations, Finance, Legal, Deal Desk, Marketing, and Platform Support teams across the entire revenue lifecycle from prospecting through renewal. \n\n \n\nWe’re looking for a Product Manager who has a proven track record of deploying AI solutions in enterprise GTM or revenue operations environments. You should get excited about building an AI-powered Sales Command Center, designing intelligent deal routing that cuts cycle times, or creating predictive pipeline models that surface risks before they impact the business. Your customers are internal commercial teams — sellers, account managers, traders, and operations leaders — who need AI that is practical, trustworthy, and embedded in their daily workflows. \n\n \n\nThe Trade Desk Product Team hires courageous, passionate PMs who set big goals and execute them. We help you grow and challenge you with hard, meaningful work. We celebrate our successes and learn from our failures together. We value and develop strong leadership, asking our PMs to take on ambitious and often ambiguous projects that promise to extend our lead in the industry. \n\nWHAT YOU WILL BE DOING \n\nAs the Staff PM for AI-Powered Commercial Intelligence, you will own the vision, strategy, and execution of AI capabilities across our Business Technology portfolio. AI is not a separate initiative on our roadmap — it’s embedded in how we build. Every strategic theme in our 2026 roadmap has an AI dimension, and you will be the driving force behind making those capabilities real. \n\n \n\nOn a typical day, you might: \n\nEvaluate and select AI/LLM platform vendors (e.g., Microsoft Power Platform, Salesforce Einstein/Agentforce, workflow automation platforms) for integration into our commercial operations stack \n\nDesign an agentic AI workflow that automatically routes and prioritizes deals based on deal attributes, historical patterns, and pipeline signals \n\nCollaborate with RevOps to build predictive models that surface pipeline risks, coverage gaps, and expansion opportunities before they impact the forecast \n\nArchitect the Sales Command Center product vision — a single pane of glass for commercial teams with AI-generated prioritized action lists drawn from conversations, emails, activities, and platform signals \n\nWrite a technical specification for AI-powered task automation that generates tasks from campaign events, underpacing alerts, and advertiser behavior \n\nPresent an AI adoption strategy to GTM leadership, articulating ROI, change management approach, and phased rollout plans \n\nAnalyze adoption metrics and user feedback to iterate on AI features — measuring whether intelligent automation is reducing cognitive load for sellers \n\n \n\nYour responsibilities include: \n\nOwning the AI strategy and roadmap for the Business Technology team — defining where AI creates the highest-leverage impact across intelligent automation, proactive insights, enhanced decision-making, reduced cognitive load, and scaled personalization \n\nDelivering an AI Enabled Platform for GTM and Sales Operations — a platform-based approach to introduce AI into commercial workflows without building custom one-off solutions for every use case \n\nPartnering deeply with cross-functional stakeholders — Revenue Operations, Sales Leadership, Client Services, Finance, and Engineering — to ensure AI solutions solve real problems and drive measurable outcomes \n\nEstablishing AI adoption metrics and feedback loops that measure not just deployment but genuine impact on seller productivity, forecast accuracy, and deal velocity \n\nEvaluating and integrating AI/LLM vendors and platforms that sit on top of Salesforce and integrate with core systems — enabling consistent, scalable rollout of capabilities without bespoke development \n\nChampioning responsible AI practices — ensuring AI solutions are trustworthy, explainable, and build confidence rather than skepticism among internal users \n\n \n\nThis is a strategic role within the Business Technology organization where you will be a founding voice in how The Trade Desk applies AI to its commercial operations at scale. \n\nWHAT YOU BRING TO THE TABLE \n\nREQUIRED: \n\n6+ years of GTM / RevOps / Product / Program experience, with at least 2 years focused on AI/ML-powered products, internal tools, or enterprise platforms \n\nHands-on experience with AI agentic workflows and LLM-based SaaS platforms — you have personally scoped, evaluated, and deployed AI solutions in a GTM, sales operations, or revenue operations context (not just observed them) \n\nDeep understanding of commercial/GTM operations workflows — lead-to-cash, pipeline management, forecasting, deal desk operations, account planning, or revenue operations. You understand the pain points because you’ve lived them or built solutions for them \n\nProven track record of building data-driven business cases and delivering measurable impact — you can articulate results in terms of hours saved, cycle time reduced, forecast accuracy improved, or revenue accelerated \n\nExperience with CRM as a platform — you understand CRM platforms and architecture, data models, and the ecosystem of tools that extend it (Microsoft Power Platform, Salesforce Agentforce, AppExchange, workflow automation platforms) \n\nStrong analytical skills with the ability to work directly with data — SQL proficiency, comfort building dashboards and reports, and the ability to define and track KPIs that measure AI adoption and business impact \n\nExcellent communication skills — you can translate AI capabilities into business value for sales leadership, articulate technical trade-offs to engineering, and drive consensus across diverse stakeholder groups \n\nSTRONGLY PREFERRED: \n\nExperience building or deploying AI-powered sales intelligence, conversation intelligence, or revenue intelligence platforms (e.g., Gong, Clari, Microsoft Power Platform, People.ai, Salesforce Sales Cloud Einstein, or similar) \n\nFamiliarity with modern AI/ML concepts including LLMs, RAG architectures, prompt engineering, AI agents, function calling, and model evaluation — you don’t need to build models, but you need to know what’s possible and what’s practical \n\nExperience with change management and driving AI adoption across large sales or commercial organizations — you understand that technology alone doesn’t drive outcomes; adoption does \n\nBackground in advertising technology, media, or high-growth B2B SaaS environments with complex commercial motions \n\nExperience with workflow automation platforms that integrate with Salesforce and other enterprise systems (e.g., Workato, Tray.io, MuleSoft, or custom integrations) \n\nDurability and grit — sometimes solutions take creative thinking, multiple iterations, and staging while dependencies solidify. You try many different approaches to find the right answer \n\nEnthusiasm for the rapid evolution of AI capabilities and a desire to stay on top of emerging tools, frameworks, and best practices in AI-powered enterprise operations.",
          "value_type": "long_text"
        }
      ],
      "id": 5046949007,
      "updated_at": "2026-02-09T12:21:21-05:00",
      "requisition_id": null,
      "title": "Staff Product Manager, AI-Powered Commercial Intelligence ",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-09T12:21:21-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5046911007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4590253007,
      "location": {
        "name": "Bellevue"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Product Management",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "WHO WE ARE LOOKING FOR \n\nThis is a strategic Product Management role where you will own the long-term roadmap and unified strategy for two of The Trade Desk’s most critical enterprise systems — Salesforce and Anaplan. You’ll spend your days navigating complex stakeholder landscapes across Sales, Revenue Operations, Finance, and FP&A, translating competing business needs into a cohesive platform vision that accelerates how TTD plans, forecasts, and executes commercially. \n\nYou’ll be expected to confidently discuss the interplay between CRM pipeline management and financial forecasting workflows, explain how opportunity data should flow between Salesforce and a connected planning system, or articulate the strategic value of maintaining a single source of truth for revenue data. \n\nWe’re looking for a systems-thinking Product Manager who has built strategies that bridge commercial execution with financial planning — not just someone who has configured Salesforce or built Anaplan models, but someone who can envision and deliver the integrated experience that makes both systems more valuable together than apart. \n\nOur Business Technology team is chartered to remove friction from TTD’s internal business systems so our commercial and GTM teams can focus on what matters: achieving company revenue goals, winning and growing client relationships, and becoming more efficient. In 2026, we are establishing Salesforce as our commercial operating system while integrating it with Anaplan for unified forecasting and financial planning — and this role is the strategic owner of that convergence. \n\nThe Trade Desk Product Team hires courageous, passionate PMs who set big goals and execute them. We help you grow and challenge you with hard, meaningful work. We celebrate our successes and learn from our failures together. We value and develop strong leadership, asking our PMs to take on ambitious and often ambiguous projects that promise to extend our lead in the industry. \n\nWHAT YOU WILL BE DOING \n\nYou will define and own the product strategy for how Salesforce and Anaplan work together as an integrated commercial planning ecosystem at The Trade Desk. This means establishing the long-term vision for how pipeline data, forecasting, revenue reporting, compensation planning, and operational workflows flow seamlessly between these platforms — while maintaining Salesforce as the authoritative system of record. \n\nYou will roll up your sleeves and dive deep into the challenges our Finance, FP&A, Revenue Operations, and commercial teams face every day. This means shadowing forecast review cycles, understanding how rolling and intramonth forecasts are manually managed today, and mapping the friction points that hinder data-driven decision-making. From this hands-on discovery, you’ll synthesize insights into a north star vision and strategic roadmap for our commercial systems architecture. \n\nOn a typical day, you might: \n\nFacilitate a cross-functional design session with FP&A and RevOps to define how sellers should update forecasts in Salesforce with data flowing automatically to Anaplan \n\nReview integration architecture with Enterprise Engineering to evaluate API patterns, data sync frequency, and error handling between Salesforce and Anaplan \n\nAnalyze discrepancies between Salesforce pipeline data and Anaplan forecast models to identify where manual reconciliation is creating risk \n\nPresent a strategic roadmap to Operations, Sales, and Finance leadership articulating the phased approach to unifying forecasting, dependencies on data foundation work, and expected business impact \n\nWork with the Account Hierarchy team to ensure brand entity mapping supports both Salesforce reporting and Anaplan planning dimensions \n\nEvaluate Anaplan’s evolving AI capabilities (Forecaster, CoModeler, role-based agents) and assess how they could enhance TTD’s forecasting and compensation workflows \n\n \n\nYour responsibilities include: \n\nUnified Platform Strategy: Defining the long-term vision for how Salesforce and Anaplan integrate and operate as a cohesive commercial planning ecosystem, with Salesforce as the system of record for pipeline, forecasting, and execution \n\nSalesforce-Anaplan Integration: Owning the product roadmap for the Salesforce and Anaplan Integration — enabling sellers to update forecasts inside Salesforce with seamless population to Anaplan and full reporting/dashboard visibility \n\nForecasting & Reporting Transformation: Driving the shift from a fragmented, judgment-based forecasting model to a unified, data-driven approach with clear visibility into coverage gaps, risk signals, and corrective actions \n\nFinancial Systems Partnership: Serving as the primary product partner to Finance Systems and FP&A, deeply understanding their planning cycles, compensation modeling needs, and reporting requirements \n\nData Foundation & Governance: Partnering with Enterprise Analytic teams to ensure clean, structured data flows between systems — the prerequisite for accurate forecasting and future AI/ML-powered insights \n\nCross-Functional Stakeholder Management: Navigating complex organizational dynamics across Sales, RevOps, Finance, FP&A, Deal Desk, and Engineering to build consensus and drive adoption of new workflows \n\nAI Integration Strategy: Evaluating and incorporating AI capabilities from both Salesforce and Anaplan into the integrated forecasting and planning workflow \n\nChange Management & Enablement: Designing adoption strategies that account for behavioral change required when sellers and finance teams shift to new forecasting workflows \n\nThis is a strategic role within the Business Technology organization where you will lead cross-system initiatives and provide hands-on product leadership in a complex, fast-paced environment with significant executive visibility. \n\nWHAT YOU BRING TO THE TABLE \n\nREQUIRED: \n\n7+ years of Product Management experience with enterprise business systems, internal platforms, or B2B SaaS products — with at least 3 years focused on CRM, financial planning, or revenue operations systems \n\nProven experience building product strategy that spans multiple enterprise systems — you have owned roadmaps that required integrating platforms like Salesforce, Anaplan, Workday, NetSuite, or similar enterprise applications and can articulate the trade-offs between different integration approaches \n\nDeep understanding of revenue operations and financial planning processes including pipeline management, forecasting methodologies, quota/territory planning, compensation modeling, or lead-to-cash workflows \n\nDemonstrated experience partnering with Finance, FP&A, or Revenue Operations teams as a product owner — you understand their planning cadences, data requirements, and the precision they demand \n\nStrong technical acumen for enterprise integration patterns — you can discuss data models, API architectures, sync strategies, and data governance with engineering teams without needing translation \n\nProven track record of managing complex stakeholder landscapes — you have navigated competing priorities across commercial, finance, and technical teams to deliver initiatives with measurable business outcomes \n\nExcellent communication skills: You can present a multi-year systems strategy to senior leadership with the same confidence you bring to a technical design review with engineers, and you can translate between business and technical audiences fluently \n\n \n\nSTRONGLY PREFERRED: \n\nDirect experience with Salesforce (Sales Cloud, Lightning, reporting/dashboards) and/or Anaplan (model architecture, planning workflows, integration with CRM systems) \n\nExperience in a high-growth technology company where commercial systems had to scale rapidly alongside revenue growth \n\nFamiliarity with enterprise integration tools and patterns (MuleSoft, Informatica, REST/SOAP APIs, ETL pipelines) used to connect CRM with financial planning systems \n\nUnderstanding of AI/ML applications in forecasting, sales performance management, or financial planning — and a perspective on how these should be integrated into enterprise workflows \n\nBackground in advertising technology, digital media, or SaaS platforms with complex partner/advertiser ecosystems \n\nExperience with change management frameworks and driving adoption of new enterprise workflows across large, distributed organizations \n\nDurability and grit — enterprise systems transformations require creative problem-solving, multiple iterations, and the patience to stage work while cross-system dependencies solidify. You try many different approaches to find the right answer.",
          "value_type": "long_text"
        }
      ],
      "id": 5046911007,
      "updated_at": "2026-02-09T12:15:13-05:00",
      "requisition_id": null,
      "title": "Staff Product Manager, Commercial Systems Strategy",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-09T12:14:19-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4839695007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4479998007,
      "location": {
        "name": "Bellevue; Boulder; Denver; Seattle"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Product Management",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4839695007,
      "updated_at": "2026-01-06T10:46:30-05:00",
      "requisition_id": "REQ-8294",
      "title": "Staff Product Manager, Developer Platform",
      "company_name": "The Trade Desk",
      "first_published": "2025-08-25T21:50:39-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4952281007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4540910007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "UX & UI Design",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4952281007,
      "updated_at": "2026-02-12T17:01:43-05:00",
      "requisition_id": "REQ-8431",
      "title": "Staff UX Designer",
      "company_name": "The Trade Desk",
      "first_published": "2025-10-21T14:24:07-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5006516007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4570755007,
      "location": {
        "name": "Sydney"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Software Engineering",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5006516007,
      "updated_at": "2025-12-17T04:32:44-05:00",
      "requisition_id": null,
      "title": "Systems Operations Engineer",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-17T04:32:44-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5017649007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4576192007,
      "location": {
        "name": "Los Angeles"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "IT",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5017649007,
      "updated_at": "2026-01-08T15:55:26-05:00",
      "requisition_id": "REQ-8637",
      "title": "Technology Compliance Analyst",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-08T15:55:26-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5003589007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4569279007,
      "location": {
        "name": "Hamburg"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5003589007,
      "updated_at": "2026-02-10T08:43:26-05:00",
      "requisition_id": "REQ-8599",
      "title": "Trading Specialist",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-11T17:55:39-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5010200007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4572549007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5010200007,
      "updated_at": "2026-02-04T10:09:09-05:00",
      "requisition_id": "REQ-8615",
      "title": "Trading Specialist",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-23T07:16:19-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5024620007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4579710007,
      "location": {
        "name": "London"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5024620007,
      "updated_at": "2026-01-20T06:31:33-05:00",
      "requisition_id": "REQ-8653",
      "title": "Trading Specialist (Centre of Excellence)",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-14T16:33:51-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5019313007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4573324007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Executive",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5019313007,
      "updated_at": "2026-01-22T12:52:26-05:00",
      "requisition_id": null,
      "title": "Vice President, Business Development - Independent Agencies",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-08T23:42:48-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5041370007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4587747007,
      "location": {
        "name": "Chicago; Los Angeles; New York; San Francisco"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": "Full time",
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "Job Title: Director, Business Development\nLocation:  1114 6th Avenue, New York, NY 10110\n*Telecommuting permitted: work may be performed within normal commuting distance from The Trade Desk, Inc. office in New York, NY\n \nJob Duties: Be the primary contact for customers and be in regular communication with customers to assess customer satisfaction and react to any issues. Compile industry trend data and campaign and spend data from various platforms to assemble client facing materials for the purpose of selling through products. Collect and analyze data related to customers target demographics and users, advising them on best practices of reaching intended audience. Use various platforms to analyze spend and marketing activity data to present back to customers to illustrate successful use of product. Help companies form their marketing strategy as it relates to digital and programmatic channels. Forecast all potential activity for customers and analyze various trends in marketing spend for those partners helping them to optimize activity. Responsible for being expertly aware of customers competitors, helping them to create unique marketing strategies. Closely monitor industry trends and trade literature to expertly speak to customers about state of the industry and guide them to adapt strategies. Attend tradeconferences to meet with customers and prospective customers educating them on company software. Develop and implement various procedures for company teams to service customers.\n \nSalary: $117,042 - $179,400/year\n \nJob Requirements: Bachelor’s degree (U.S. or foreign equivalent) in Marketing, Marketing Management or related field and eight (8) years of experience in the job offered or related role. Must have three (3) years of sales experience working for an online publisher, ad network, ad exchange, ad server, or senior agency. Must have three (3) years of experience meetingcompany revenue goals, including developing strong client relationships at media agencies, pitching capabilities and customizing ad tech products and services to meet their programmaticneeds, and using Salesforce to track and report revenue. Must have three (3) years of communication experience, including speaking with C-level clients to pitch ad tech products and services within a large media agency. Must have three (3) years of negotiation experience including building commercial endeavors and rate cards for a media agency client. Must haveone (1) year of experience creating relationships with decision-makers at enterprise client level,including having directly sold media or ad tech services to programmatic teams and Strategic Investments teams. Domestic travel required up to 10% of the time to visit client sites.\n\n#LI-DNI",
          "value_type": "long_text"
        }
      ],
      "id": 5041370007,
      "updated_at": "2026-02-05T13:48:21-05:00",
      "requisition_id": "REQ-8685",
      "title": "VP, Business Development, Growth",
      "company_name": "The Trade Desk",
      "first_published": "2026-02-05T13:48:21-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5014236007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4568565007,
      "location": {
        "name": "Los Angeles; New York; San Francisco"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5014236007,
      "updated_at": "2026-01-05T16:24:15-05:00",
      "requisition_id": null,
      "title": "VP, Business Development - Regulatory & Franchise Verticals",
      "company_name": "The Trade Desk",
      "first_published": "2026-01-04T11:43:00-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4841945007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4481143007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Client Services",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 4841945007,
      "updated_at": "2025-11-10T17:05:10-05:00",
      "requisition_id": null,
      "title": "VP, Client Services, Global Advertiser CPG",
      "company_name": "The Trade Desk",
      "first_published": "2025-09-04T14:28:45-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5006824007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": true
        }
      ],
      "internal_job_id": 4570932007,
      "location": {
        "name": "Hamburg"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": null,
          "value_type": "long_text"
        }
      ],
      "id": 5006824007,
      "updated_at": "2026-02-12T03:51:47-05:00",
      "requisition_id": null,
      "title": "VP, DACH",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-22T06:13:48-05:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/4694184007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4371246007,
      "location": {
        "name": "New York"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Sales",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "Head of Strategic Initiatives \n\nThe Trade Desk is changing the way global brands and their agencies advertise to audiences around the world. How? With a media-buying platform that helps brands deliver a more insightful and relevant ad experience for consumers — and sets a new standard for global  \nreach, accuracy, and transparency. \n\nSo if you’re talented, driven, creative, and hungry to bring something entirely new and wildly ambitious into the world (and have some fun doing it), then we want to talk. \n\nPosition Summary: \n\nThe Head of Strategic Initiatives will assist the Chief Strategy Officer in overseeing global business partnerships and initiatives within the Strategy team and serve as a trusted partner to the CSO and executive team. He or she will collaborate across a 4000 person organization working with all areas of the business and engineering teams including partnerships, business operations, sales, client services, product, marketing, and legal. \n\nWhat you’ll be doing: \n\nServe as key strategic counsel and close partner to Trade Desk's CSO as we continue to scale the company and evolve the company’s strategy, partnerships, client service model, product offering and organizational structure.  \n\nTranslate CSO directives into an action plans consistent with the vision, culture, and pace of the company. \n\nIn partnership with executive leadership and their broader operational teams, ensure that the company has thoughtful, regular internal communications about business milestones, challenges, and progress. \n\nAssist with driving new initiatives – sourcing partnership opportunities to define and execute on new opportunities or ways of doing business aligned with our strategic vision. \n\nBuild a strong, trusted relationship with The Trade Desk's CSO to support and/or lead as new initiatives arise or lines of business expand. \n\nBuild strong relationships across the organization. Establish credibility with the executive team and broader organization by listening and learning about what makes The Trade Desk unique and where we have opportunities to expand and improve. \n\nProvide support and oversight for special projects and initiatives. \n\nHold senior leaders accountable to action plans through strong project management and communication. \n\nLead special projects that cross functional lines and transition ownership to leader(s) to scale as needed. \n\nWho you are: \n\nThe successful candidate will be a well-rounded business leader who understands public company resource management and team collaboration, and has thrived in both larger and smaller-scale organizations, ideally in a variety of industries. She or he will have hands-on experience building highly efficient and effective teams, programs, partnerships, and processes. Success is viewed as achieving business results, with extreme ownership and accountability – not just being busy. He or she will have experience crafting strategic partnerships, which are then executed and maintained by themselves or their teams. S/he will makes decisions and proposals backed by data and analysis. The candidate will be innately nonpolitical, open, authentic, service-oriented, driven, and low ego. S/he should display a management style that emphasizes collaboration, and will work seamlessly across the company’s functions and levels. \n\n \n\n10+ years of experience creating, building, or leading Strategy, Partnership and/or Operations teams. \n\nOutstanding project and partner management skills. \n\nStrong communication skills with the ability to craft a compelling strategy, and translate it to an inspirational vision to be communicated to the industry or key executives at partners or potential partners.  \n\nExperience in planning, setting priorities, and driving execution for maximum impact across sizeable organizations. \n\nExperience negotiating and executing complex and innovative deals \n\nDemonstrated ability to work across organizational boundaries to build alignment and drive closure on issues and drive results. \n\nEmpathetic leader who knows how to get stuff done while role-modeling company values including vision, grit, agility, generosity, openness, and full heartedness. vpda",
          "value_type": "long_text"
        }
      ],
      "id": 4694184007,
      "updated_at": "2026-01-21T13:55:00-05:00",
      "requisition_id": null,
      "title": "VP, Head of Strategic Initiatives",
      "company_name": "The Trade Desk",
      "first_published": "2025-03-31T20:47:05-04:00",
      "language": "en"
    },
    {
      "absolute_url": "https://job-boards.greenhouse.io/thetradedesk/jobs/5000105007",
      "data_compliance": [
        {
          "type": "gdpr",
          "requires_consent": false,
          "requires_processing_consent": false,
          "requires_retention_consent": false,
          "retention_period": null,
          "demographic_data_consent_applies": false
        }
      ],
      "internal_job_id": 4567364007,
      "location": {
        "name": "Los Angeles; New York; San Francisco; Ventura"
      },
      "metadata": [
        {
          "id": 4744161007,
          "name": "Careers Site Category",
          "value": "Finance",
          "value_type": "single_select"
        },
        {
          "id": 4756220007,
          "name": "Time Type",
          "value": null,
          "value_type": "single_select"
        },
        {
          "id": 4870662007,
          "name": "Job Description",
          "value": "We are looking for a strategic yet hands-on VP of Procurement to partner with leaders across the organization. This person will report directly to our CFO and will be responsible for shaping and executing a global procurement strategy that drives efficiency, scalability, and innovation.\n\nWhat You’ll Do: \n\nProvide procurement and financial thought leadership, identifying and developing strategic opportunities to optimize spend and drive enterprise-wide efficiency \n\nPartner across Finance, Legal, IT, Product, and Operations to define and implement global procurement strategies that scale with business growth \n\nDistill data-driven insights from spend analytics and market trends to inform sourcing decisions and uncover recurring cost-saving opportunities \n\nLead negotiation and execution of enterprise-level vendor agreements, delivering measurable business outcomes with minimal oversight \n\nWork collectively with global Sales, Marketing, and Client Services teams to align procurement initiatives with revenue and growth objectives \n\nCollaborate closely with product and technology leaders to ensure procurement supports innovation and time-to-market goals \n\nBuild deep and lasting relationships internally across The Trade Desk departments and externally with strategic vendors \n\nOversee risk assessments and compliance processes to safeguard data privacy, security, and regulatory adherence \n\nIn many cases, you will be proactively identifying and solving procurement challenges before they impact the business \n\nWho you are: \n\nBachelor's degree in Finance, Accounting, Business Administration, or a related field; MBA or advanced degree preferred \n\n15+ years of procurement experience, with at least 7 years in a leadership role within a global technology or SaaS organization \n\nProven track record of managing enterprise-level vendor negotiations and delivering cost savings \n\nStrong understanding of SaaS, cloud infrastructure, and technology procurement \n\nExperience implementing procurement systems and driving process standardization globally \n\nExcellent leadership, communication, and stakeholder management skills \n\nKnowledge of compliance frameworks (SOX, GDPR) and risk management practices",
          "value_type": "long_text"
        }
      ],
      "id": 5000105007,
      "updated_at": "2026-01-13T15:20:26-05:00",
      "requisition_id": null,
      "title": "VP, Procurement",
      "company_name": "The Trade Desk",
      "first_published": "2025-12-08T12:59:31-05:00",
      "language": "en"
    }
  ]
}